schmmd/soleCAN/esp32-s3/src/main.cpp
// One throttled reconnect burst per interval while the configured home network
// is out of range. No-op when STA isn't configured or is already connected.
static void staRetryTick() {
    if (!staConfigured() || WiFi.status() == WL_CONNECTED) return;
    if (millis() - g_sta_last_attempt_ms < STA_RETRY_INTERVAL_MS) return;
    staBeginJoin();
}

// ── USB port role ─────────────────────────────────────────────────────────────
// The native USB-CDC port has a runtime-selectable role. Boots to LOGGING (enum
// 0); RAM-only, so a power cycle always returns to logging. Switched via the
// /usb control page (POST) or a `mode` command typed over the USB console.
//   logging — USB streams device debug/status lines (usbLoggingPoll)
//   slcan   — USB is the SLCAN CAN channel (slcanPoll)
//   kelly   — transparent USB<->Kelly bridge (ENABLE_KELLY only); suspends the
//             regular Kelly monitor polling while active
enum UsbMode { USB_LOGGING = 0, USB_SLCAN, USB_KELLY };
static UsbMode g_usb_mode = USB_LOGGING;

static const char* usbModeName(UsbMode m) {
    switch (m) {
        case USB_SLCAN:   return "slcan";
        case USB_KELLY:   return "kelly";
        case USB_LOGGING: default: return "logging";
    }
}

// Parse a mode name into `out`. Rejects "kelly" unless this is an ENABLE_KELLY
// build, so non-Kelly boards can never select the bridge.
static bool usbModeFromName(const String& s, UsbMode& out) {
    if (s == "logging") { out = USB_LOGGING; return true; }
    if (s == "slcan")   { out = USB_SLCAN;   return true; }
#if defined(ENABLE_KELLY)
    if (s == "kelly")   { out = USB_KELLY;   return true; }
#endif
    return false;
}

// Defined near the SLCAN section (they print over Serial / read device state).
static bool tryModeCommand(const char* line);
static bool tryWifiCommand(const char* line);
static bool trySdCommand(const char* line);
void usbLoggingPoll();

// NVS 'wifi' namespace overrides the compiled defaults; an absent 'ssid' key
// means "never provisioned", so fall back to the baked-in defaults (keeps the
// default build's behavior). Call once, before WiFi bring-up.
static void loadStaCreds() {
    g_prefs.begin("wifi", /*readOnly=*/true);
    if (g_prefs.isKey("ssid")) {
        g_prefs.getString("ssid", g_sta_ssid, sizeof(g_sta_ssid));
        g_prefs.getString("pass", g_sta_pass, sizeof(g_sta_pass));
    } else {
        strlcpy(g_sta_ssid, WIFI_SSID, sizeof(g_sta_ssid));
        strlcpy(g_sta_pass, WIFI_PASS, sizeof(g_sta_pass));
    }
    g_prefs.end();
}

static void saveStaCreds(const char* ssid, const char* pass) {
    g_prefs.begin("wifi", /*readOnly=*/false);
    g_prefs.putString("ssid", ssid);
    g_prefs.putString("pass", pass);
    g_prefs.end();
}

// Length-independent compare so a wrong AP password can't be timing-probed.
static bool secretEquals(const String& got, const char* want) {
    size_t wl = strlen(want);
    uint8_t diff = (got.length() != wl) ? 1 : 0;
    for (size_t i = 0; i < got.length(); i++)
        diff |= (uint8_t)got[i] ^ (uint8_t)(i < wl ? want[i] : 0);
    return diff == 0;
}

// Minimal HTML-escape for reflecting the current SSID into the form.
static String htmlEscape(const char* s) {
    String out;
    for (const char* p = s; *p; p++) {
        switch (*p) {
            case '&': out += "&amp;";  break;
            case '<': out += "&lt;";   break;
            case '>': out += "&gt;";   break;
            case '"': out += "&quot;"; break;
            default:  out += *p;       break;
        }
    }
    return out;
}

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

#if defined(AUTOSHUTDOWN)
esp_sleep_wakeup_cause_t g_wake_cause = ESP_SLEEP_WAKEUP_UNDEFINED;   // set once in setup()
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── SD-card session logging (RejsaCAN) ──────────────────────────────────────────
// Records two streams to the onboard microSD whenever a card is present at boot.
// The card is mounted at boot, but the session directory is only created on the
// first received CAN frame: a USB-powered bench boot with no bus attached leaves
// no empty session behind.
//
//   /sNNNNN/can_PP.asc    every received CAN frame, Vector ASCII — replayable by
//                         solecan-analyze.py / solecan-stream.py --replay unchanged
//   /sNNNNN/data_PP.jsonl one buildJson() snapshot per line at SD_JSON_HZ (default 1)
//
// Design (see also the plan): loop() (core 1) only *formats* bytes and pushes them
// into two PSRAM ring buffers; a dedicated writer task (core 0) does every SD I/O.
// This keeps the decoded-state globals single-threaded — buildJson() and the .asc
// formatter both run on the loop task, and only opaque bytes cross to the writer —
// and it keeps SD stalls (block erase) off the CAN drain: a full ring drops whole
// lines (counted) rather than blocking loop(). Mid-session SD failures are
// handled by remount-and-resume (see sdRecoverOrFail); only repeated back-to-back
// failures latch "error" until reboot. No hot-insert: the card is probed once at
// boot; if it isn't there, the whole feature stays dormant (reboot to use a card
// inserted later).
#if defined(HAS_SD)

// ── Tunables ──
#ifndef SD_JSON_HZ
#define SD_JSON_HZ          1                         // decoded-snapshot cadence
#endif
// SPI clock for the card. The SD library defaults to a very conservative 4 MHz;
// the SD spec allows 25 MHz in SPI mode, and the ESP32-S3's integer divider of
// 80 MHz makes 20 MHz the highest in-spec setting. The RejsaCAN wires the slot
// straight to the module (no level shifter, no series resistors, short traces),
// so nothing on the board limits it below the chip. GPIO39/40/41 go through the
// GPIO matrix, which Espressif rates identical to IO_MUX up to 40 MHz; 40 MHz is
// out of SD spec (relies on the card's MISO output delay being better than the
// 14 ns it's allowed) — bench-verify before shipping it. Override with
// -DSD_SPI_HZ=40000000.
#ifndef SD_SPI_HZ
#define SD_SPI_HZ           20000000
#endif
#define SD_MAX_PART_BYTES   (64ULL * 1024 * 1024)     // roll raw/json parts at this size
#define SD_MIN_FREE_BYTES   (512ULL * 1024 * 1024)    // reap oldest sessions below this
#define SD_FLUSH_MS         1000                      // fsync cadence → ≤~1 s lost on power cut
#define SD_RAW_RING_BYTES   (1024UL * 1024)           // PSRAM ring for raw .asc
#define SD_JSON_RING_BYTES  (256UL * 1024)            // PSRAM ring for json lines
#define SD_FREE_CHECK_MS    10000                     // usedBytes() is slow — poll sparingly
#define SD_RECOVER_ATTEMPTS 5                         // remount tries before latching error
#define SD_RECOVER_DELAY_MS 250                       // backoff base between remount tries
#define SD_WRITE_CHUNK_BYTES 8192                     // batch writes into bursts this size

struct SdState {
    const char* state = "no_card";     // no_card | waiting | logging | error
    uint32_t          session   = 0;
    char              dir[24]   = "";  // active session dir, e.g. "/s00001" or
                                       // "/s00001-42" once the SOC suffix lands
    volatile uint32_t kb_written = 0;  // writer task (core 0) owns these two
    volatile uint32_t free_mb    = 0;
    const char*       fail_op  = "";     // which SD call failed (state == "error")
    volatile uint32_t fail_kb  = 0;      // KB written when it failed
    volatile uint32_t recoveries = 0;    // successful remount-and-resume cycles
};
