schmmd/soleCAN/esp32-s3/src/main.cpp
static SdState g_sd;

// Set true once at boot after a successful mount; gates the producer in loop()
// and the /sd/* handlers. Only ever cleared again (card failure), never
// re-armed until reboot. Cross-core rule for this flag and the status fields in
// SdState/SdStream: every field has exactly one writer, and readers (buildJson)
// tolerate a torn multi-field snapshot — no control flow crosses the core
// boundary except this flag; the writer task otherwise sees nothing but bytes
// in the ring buffers.
volatile bool g_sd_active = false;

// Session open is deferred to the first CAN frame so bus-less (USB bench) boots
// leave no empty /sNNNNN/ behind. The loop task sets this once, with the log
// t=0 timestamp, when the first frame arrives; the writer task then opens the
// session (SD I/O stays on core 0) and drains the rings that buffered the
// frames in the meantime. Until then the card sits mounted in state "waiting".
volatile bool g_sd_session_wanted = false;

// Start-of-session SOC folder rename request. The loop task (core 1) sets these
// once, when the first BMS SOC frame of the session is decoded; the writer task
// (core 0) performs the SD.rename under the mutex and clears the flag — always
// after the deferred session open above, since the writer handles the open
// first in the same loop pass. Aligned volatiles: core 1 is the sole writer of
// the pending SOC and only ever raises the flag, the writer only ever lowers it
// — no read-modify-write races.
volatile bool    g_sd_rename_pending = false;
volatile int16_t g_sd_pending_soc    = -1;   // 0..100, or -1 if SOC unknown

// Serializes every SD/SPI touch between the writer task (core 0) and the
// /sd/* HTTP handlers (loop task, core 1). The writer holds it per
// drain/flush/roll burst; HTTP holds it per operation — and per read chunk
// while streaming a tar — so a download stalls logging only briefly and the
// PSRAM rings absorb it. sdFail() must release it before self-deleting.
static SemaphoreHandle_t g_sd_mutex = nullptr;

// Session id currently being streamed as a tar by handleSdSessionGet (0 = none;
// session numbering starts at 1). The free-space reaper (sdScanSessions)
// excludes it so it can never SD.remove() a file of a session an HTTP client has
// open mid-download — illegal under FatFs FS_LOCK=0 and a volume-corruption
// risk. Set/cleared only on the loop task; volatile because the writer task
// reads it under the mutex.
static volatile uint32_t g_sd_http_stream_session = 0;

struct SdLock {
    SdLock()  { xSemaphoreTake(g_sd_mutex, portMAX_DELAY); }
    ~SdLock() { xSemaphoreGive(g_sd_mutex); }
};

// RAII guard for g_sd_http_stream_session so every early return from the tar
// handler clears the reaper exclusion.
struct SdStreamGuard {
    explicit SdStreamGuard(uint32_t id) { g_sd_http_stream_session = id; }
    ~SdStreamGuard() { g_sd_http_stream_session = 0; }
};

// One logged stream: a PSRAM ring fed by loop() (core 1) and drained to the
// current part file by the writer task (core 0). The raw .asc and the json
// .jsonl are two instances; everything that touches a stream goes through the
// shared helpers below so the two lifecycles can't drift apart.
struct SdStream {
    const char*          name_fmt;    // "<name>_%02u.<ext>" (part) — joined to g_sd.dir
    const char*          write_op;    // fail_op tag for a failed write
    const char*          open_op;     // fail_op tag for a failed part open
    bool                 asc_header;  // new parts get the Vector ASCII header
    size_t               ring_bytes;
    StreamBufferHandle_t sb = nullptr;
    StaticStreamBuffer_t sb_struct;
    uint8_t*             storage = nullptr;
    File                 file;            // writer task (core 0) owns these two
    uint64_t             part_bytes = 0;
    volatile uint16_t    part = 0;
    volatile uint32_t    dropped = 0;     // producer (core 1) owns this
};
static SdStream g_sd_raw  = { "can_%02u.asc",    "raw_write",  "raw_open",  true,  SD_RAW_RING_BYTES };
static SdStream g_sd_json = { "data_%02u.jsonl", "json_write", "json_open", false, SD_JSON_RING_BYTES };

static int64_t g_sd_session_start_us = 0;   // esp_timer µs at session open (log t=0)

// ── Producer side (runs on the loop task, core 1) ──

// Format one frame as a Vector ASCII data line and push it to the raw ring.
// Line-atomic: if the whole line doesn't fit, drop it and count it rather than
// write a fragment or block the CAN drain.
static inline void sdEnqueueRaw(const twai_message_t& msg) {
    char line[96];
    double ts = (esp_timer_get_time() - g_sd_session_start_us) / 1e6;
    int n = snprintf(line, sizeof line, " %.6f 1  %0*lX%s   Rx   d %u",
                     ts, msg.extd ? 8 : 3, (unsigned long)msg.identifier,
                     msg.extd ? "x" : "", (unsigned)msg.data_length_code);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof line - 4; i++)
        n += snprintf(line + n, sizeof line - n, " %02X", msg.data[i]);
    if (n < (int)sizeof line - 1) line[n++] = '\n';
    if (xStreamBufferSpacesAvailable(g_sd_raw.sb) >= (size_t)n)
        xStreamBufferSend(g_sd_raw.sb, line, n, 0);
    else
        g_sd_raw.dropped = g_sd_raw.dropped + 1;
}

// Push one JSON snapshot (built by the caller) as a line to the json ring. Only a
// single producer touches the ring, so the space check can't race with a shrink
// (the consumer only frees space), making the two sends effectively atomic.
static inline void sdEnqueueJson(const String& js) {
    size_t len = js.length();
    if (xStreamBufferSpacesAvailable(g_sd_json.sb) >= len + 1) {
        xStreamBufferSend(g_sd_json.sb, js.c_str(), len, 0);
        xStreamBufferSend(g_sd_json.sb, "\n", 1, 0);
    } else {
        g_sd_json.dropped = g_sd_json.dropped + 1;
    }
}

// ── Writer side (runs on the dedicated task, core 0) ──

// Vector ASCII header. The ESP32 has no RTC/NTP, so the wall-clock date is
// nominal; what matters to the readers is "base hex" + "timestamps absolute"
// and monotonic per-line timestamps (which are session-relative seconds).
static void sdWriteAscHeader(File& f) {
    f.print("date Thu Jan 1 00:00:00.000 1970\n");
    f.print("base hex  timestamps absolute\n");
    f.print("internal events logged\n");
    f.print("   0.000000 Start of measurement\n");
}

// Basename of a directory entry — e.name() may or may not carry a leading path
// depending on core version.
static const char* sdBasename(const char* name) {
    const char* slash = strrchr(name, '/');
    return slash ? slash + 1 : name;
}

