schmmd/soleCAN/esp32-s3/src/main.cpp
// Session-dir parsing/naming lives in session_name.h (sessionParse, etc.) so it
// can be host-tested; sessionParse tolerates the "-socSS" SOC suffix.

// One walk of the root directory serving both consumers: the highest session
// index (next session number = highest + 1, monotonic per card, survives
// reaping and card swaps with no counter file) and the lowest index excluding
// the active session (the reaper's victim). 0 / UINT32_MAX when none exist.
static void sdScanSessions(uint32_t& lowest_other, uint32_t& highest) {
    lowest_other = UINT32_MAX;
    highest = 0;
    File root = SD.open("/");
    if (!root) return;
    for (File e = root.openNextFile(); e; e = root.openNextFile()) {
        uint32_t n;
        if (e.isDirectory() && sessionParse(sdBasename(e.name()), n)) {
            if (n > highest) highest = n;
            if (n < lowest_other && n != g_sd.session &&
                n != g_sd_http_stream_session) lowest_other = n;
        }
        e.close();
    }
    root.close();
}

// Open the stream's current part file (fresh — FILE_WRITE truncates) and reset
// its size accounting.
static bool sdOpenPart(SdStream& s) {
    char name[24], path[48];
    snprintf(name, sizeof name, s.name_fmt, s.part);
    snprintf(path, sizeof path, "%s/%s", g_sd.dir, name);
    s.file = SD.open(path, FILE_WRITE);
    if (!s.file) return false;
    if (s.asc_header) sdWriteAscHeader(s.file);
    s.part_bytes = 0;
    return true;
}

// Writer task only. t=0 (g_sd_session_start_us) is set by the producer when it
// requests the session, so the frames buffered before this runs stamp correctly.
static bool sdStartSession() {
    uint32_t lowest, highest;
    sdScanSessions(lowest, highest);
    g_sd.session   = highest + 1;
    g_sd_raw.part  = 0;
    g_sd_json.part = 0;
    // Born without a SOC suffix — it's appended by a rename once the first BMS
    // SOC frame is decoded (see sdApplyRename).
    sessionDirName(g_sd.dir, sizeof g_sd.dir, g_sd.session);
    if (!SD.mkdir(g_sd.dir)) return false;
    if (!sdOpenPart(g_sd_raw)) return false;
    if (!sdOpenPart(g_sd_json)) { g_sd_raw.file.close(); return false; }
    return true;
}

// Delete a session directory. Sessions hold only flat files (can_PP.asc /
// data_PP.jsonl), so remove them one at a time — re-opening the dir each pass
// avoids invalidating the FatFS iterator by deleting during a walk.
static bool sdRemoveSessionDir(const char* path) {
    for (;;) {
        File d = SD.open(path);
        if (!d) return false;
        File e = d.openNextFile();
        if (!e) { d.close(); break; }
        char child[80];
        snprintf(child, sizeof child, "%s/%s", path, sdBasename(e.name()));
        e.close();
        d.close();
        if (!SD.remove(child)) return false;
    }
    return SD.rmdir(path);
}

// Resolve a session number to its actual on-disk directory path, which may carry
// a "-socSS" SOC suffix, so callers can't just rebuild "/sNNNNN". One root walk,
// same dir filter as the reaper. Returns false if no such session exists. Caller
// must hold g_sd_mutex (every caller already operates under SdLock).
static bool sdResolveDir(uint32_t session, char* out, size_t cap) {
    File root = SD.open("/");
    if (!root) return false;
    bool found = false;
    for (File e = root.openNextFile(); e; e = root.openNextFile()) {
        uint32_t n;
        if (e.isDirectory() && sessionParse(sdBasename(e.name()), n) && n == session) {
            snprintf(out, cap, "/%s", sdBasename(e.name()));
            found = true;
            e.close();
            break;
        }
        e.close();
    }
    root.close();
    return found;
}

// Reap the oldest session dir, never the active one. Returns false when there's
// nothing else to delete.
static bool sdReapOldest() {
    uint32_t oldest, highest;
    sdScanSessions(oldest, highest);
    if (oldest == UINT32_MAX) return false;
    char path[24];
    if (!sdResolveDir(oldest, path, sizeof path)) return false;
    return sdRemoveSessionDir(path);
}

// Refresh free-space figure and reap oldest sessions until we're back above the
// threshold (or only the active session remains).
static void sdUpdateFree() {
    uint64_t total = SD.totalBytes();
    uint64_t used  = SD.usedBytes();
    uint64_t freeb = total > used ? total - used : 0;
    while (freeb < SD_MIN_FREE_BYTES) {
        if (!sdReapOldest()) break;
        used  = SD.usedBytes();
        freeb = total > used ? total - used : 0;
    }
    g_sd.free_mb = (uint32_t)(freeb >> 20);
}

// Total bytes written this session, both streams. Writer task (core 0) owns it.
static uint64_t sd_total_bytes = 0;

// Give up logging for the rest of this boot. The CAN tap keeps running. `op` and
// the running byte count are kept for the /json status so a field failure is
// diagnosable. Self-deletes the calling task — only callable from the writer
// task; boot-time failures latch their error in sdInit() instead.
static void sdFail(const char* op) {
    g_sd.fail_op = op;
    g_sd.fail_kb = (uint32_t)(sd_total_bytes >> 10);
    g_sd_active  = false;
    g_sd.state   = "error";
    if (g_sd_raw.file)  g_sd_raw.file.close();
    if (g_sd_json.file) g_sd_json.file.close();
    xSemaphoreGive(g_sd_mutex);   // held by the writer's burst — free it or HTTP deadlocks
    vTaskDelete(nullptr);
}

// An SD call failed mid-session. Observed failure mode on the RejsaCAN: the card
// stops answering CMD13 (SEND_STATUS) under sustained write load — on two
// different cards and both Arduino cores — and a reboot always brings it back.
// So instead of latching "error" on the first bad write, remount and resume the
// same session with fresh part files (bounded attempts, linear backoff). The
// failed chunk is still in the caller's buffer and is re-written after we
// return; the rings keep absorbing frames while we're remounting, so a
// sub-second recovery usually loses nothing.
//
// A stream whose file was open when the failure hit moves to a fresh part — its
// on-card tail ends at the last fsync, possibly mid-line, so appending is
// unsafe. A stream whose file was already closed (a part-roll open that failed)
// retries the same, never-created part number instead of skipping one.
static void sdRecoverOrFail(const char* op) {
    if (g_sd_raw.file)  g_sd_raw.part = g_sd_raw.part + 1;
    if (g_sd_json.file) g_sd_json.part = g_sd_json.part + 1;
    for (int attempt = 1; attempt <= SD_RECOVER_ATTEMPTS; attempt++) {
        g_sd_raw.file.close();
        g_sd_json.file.close();
        SD.end();
        vTaskDelay(pdMS_TO_TICKS(SD_RECOVER_DELAY_MS * attempt));
        if (!SD.begin(SD_CS_PIN, SPI, SD_SPI_HZ)) continue;
        if (!sdOpenPart(g_sd_raw))  continue;
        if (!sdOpenPart(g_sd_json)) continue;
        g_sd.recoveries = g_sd.recoveries + 1;
        return;
    }
    sdFail(op);   // never returns
}

