schmmd/soleCAN/esp32-s3/src/main.cpp
// Drain one stream: pull a chunk from its ring and write it. Batch: drain only
// once a full chunk is waiting, or when the flush deadline arrives (so trickle
// data still lands within ~1 s). Short write bursts leave the card idle between
// them, instead of the continuous 512-byte-at-a-time program cycle that
// provoked mid-write card lockups. If a write fails, the chunk is still in buf
// after the remount, so the retry re-lands it — no data lost.
static bool sdDrainStream(SdStream& s, bool flush_due, uint8_t* buf) {
    if (!flush_due && xStreamBufferBytesAvailable(s.sb) < SD_WRITE_CHUNK_BYTES)
        return false;
    size_t n = xStreamBufferReceive(s.sb, buf, SD_WRITE_CHUNK_BYTES, 0);
    if (!n) return false;
    if (s.file.write(buf, n) != n) {
        sdRecoverOrFail(s.write_op);
        if (s.file.write(buf, n) != n) sdFail(s.write_op);
    }
    s.part_bytes += n;
    sd_total_bytes += n;
    return true;
}

// Roll to the next part once the current one reaches SD_MAX_PART_BYTES, so no
// single file grows unbounded.
static void sdRollIfDue(SdStream& s) {
    if (s.part_bytes < SD_MAX_PART_BYTES) return;
    s.file.flush();
    s.file.close();
    s.part = s.part + 1;
    if (!sdOpenPart(s)) sdRecoverOrFail(s.open_op);
}

// Append the session's start SOC to the folder name, requested by the loop task
// once the first BMS SOC frame was decoded. Both parts are closed first —
// renaming a directory with files open under it is unsafe on FatFs — and bumped
// to a fresh part so reopening (FILE_WRITE truncates) can't wipe the part just
// written. If the rename itself fails, logging continues under the old name: the
// suffix is a browsing convenience, not correctness. Writer task, under mutex.
static void sdApplyRename() {
    int soc = g_sd_pending_soc;
    g_sd_rename_pending = false;
    if (soc < 0) return;
    char newdir[24];
    sessionDirNameSoc(newdir, sizeof newdir, g_sd.session, soc);

    g_sd_raw.file.flush();  g_sd_raw.file.close();
    g_sd_json.file.flush(); g_sd_json.file.close();
    g_sd_raw.part  = g_sd_raw.part + 1;
    g_sd_json.part = g_sd_json.part + 1;
    if (SD.rename(g_sd.dir, newdir))
        strlcpy(g_sd.dir, newdir, sizeof g_sd.dir);
    // sdOpenPart now targets g_sd.dir (renamed on success, unchanged on failure).
    if (!sdOpenPart(g_sd_raw))  sdRecoverOrFail(g_sd_raw.open_op);
    if (!sdOpenPart(g_sd_json)) sdRecoverOrFail(g_sd_json.open_op);
}

static void sdWriterTask(void*) {
    static uint8_t buf[SD_WRITE_CHUNK_BYTES];   // static — doesn't fit the task stack
    uint32_t last_flush = millis();
    uint32_t last_free  = millis() - SD_FREE_CHECK_MS;   // check on first idle

    bool session_open = false;

    for (;;) {
        if (!session_open) {
            if (!g_sd_session_wanted) { vTaskDelay(pdMS_TO_TICKS(20)); continue; }
            xSemaphoreTake(g_sd_mutex, portMAX_DELAY);
            if (!sdStartSession()) sdFail("start_session");   // never returns
            session_open = true;
            g_sd.state   = "logging";
            xSemaphoreGive(g_sd_mutex);
        }
        bool flush_due = (millis() - last_flush >= SD_FLUSH_MS);

        xSemaphoreTake(g_sd_mutex, portMAX_DELAY);
        if (g_sd_rename_pending) sdApplyRename();
        bool did = sdDrainStream(g_sd_raw, flush_due, buf);
        did     |= sdDrainStream(g_sd_json, flush_due, buf);
        g_sd.kb_written = (uint32_t)(sd_total_bytes >> 10);

        sdRollIfDue(g_sd_raw);
        sdRollIfDue(g_sd_json);

        if (flush_due) {
            last_flush = millis();
            g_sd_raw.file.flush();
            g_sd_json.file.flush();
        }
        if (millis() - last_free >= SD_FREE_CHECK_MS) {
            last_free = millis();
            sdUpdateFree();
        }
        xSemaphoreGive(g_sd_mutex);

        if (!did) vTaskDelay(pdMS_TO_TICKS(20));   // both rings empty — yield
    }
}

static bool sdInitRing(SdStream& s) {
    s.storage = (uint8_t*) heap_caps_malloc(s.ring_bytes + 1, MALLOC_CAP_SPIRAM);
    if (!s.storage) return false;
    s.sb = xStreamBufferCreateStatic(s.ring_bytes, 1, s.storage, &s.sb_struct);
    return s.sb != nullptr;
}

// Probe the card once and, only on success, mount + spawn the writer
// (the session itself opens on the first CAN frame — see g_sd_session_wanted).
// Called from setup(); leaves the feature dormant (g_sd_active stays false) on
// any failure so the firmware behaves exactly as a card-less tap. Boot failures
// latch state="error" with a fail_op right here — sdFail() self-deletes the
// calling task, so it must never run on the setup/loop task.
static void sdInit() {
    g_sd_mutex = xSemaphoreCreateMutex();
    if (!g_sd_mutex || !sdInitRing(g_sd_raw) || !sdInitRing(g_sd_json)) {
        g_sd.fail_op = "ring_alloc";
        g_sd.state   = "error";
        return;
    }

    SPI.begin(SD_SCK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);
    if (!SD.begin(SD_CS_PIN, SPI, SD_SPI_HZ)) { g_sd.state = "no_card"; return; }

    g_sd.state = "waiting";
    xTaskCreatePinnedToCore(sdWriterTask, "sdwriter", 8192, nullptr, 1, nullptr, 0);
    g_sd_active = true;   // arm the producer last, once everything is ready
}

#endif  // HAS_SD

// ── LED status indicator ──────────────────────────────────────────────────────
// Single-LED boards (Adafruit Feather S3 NeoPixel) colour-code state on one
// pixel:
//   Red blink     — CAN driver failed to initialize
//   Amber blink   — No Wi-Fi up at all (AP failed and STA not connected)
//   Dim white     — Alive, no CAN frames received recently
//   Green blink   — CAN frames arriving (toggles on bus activity)
//
// Dual-LED boards (RejsaCAN-ESP32-S3) split the state across two pins:
//   Yellow slow blink — No Wi-Fi (takes priority over the Kelly heartbeat)
//   Yellow flicker    — Kelly serial traffic arriving (ENABLE_KELLY builds only)
//   Yellow off        — Network OK, no Kelly traffic (or non-Kelly build)
//   Blue blink        — CAN frames arriving
//   Blue off          — No frames recently (green power LED still shows alive)
//
// On boards without any user LED (LilyGo T-2CAN), the calls are no-ops.

#define LED_BLINK_MS         50
#define LED_ACTIVE_MS        200
#define WARN_BLINK_SLOW_MS   500   // no WiFi

static uint32_t g_led_last_toggle = 0;
static bool     g_led_on = false;

static inline void ledInit() {
#if LED_IS_NEOPIXEL
    pinMode(LED_POWER_PIN, OUTPUT);
    digitalWrite(LED_POWER_PIN, HIGH);   // enable NeoPixel power rail
#elif LED_IS_DUAL_GPIO
    pinMode(YELLOW_LED_PIN, OUTPUT);
    pinMode(BLUE_LED_PIN, OUTPUT);
    digitalWrite(YELLOW_LED_PIN, LOW);
    digitalWrite(BLUE_LED_PIN, LOW);
#endif
}

