schmmd/soleCAN/esp32-s3/src/main.cpp
    } else if (src == SRC_VEHICLE && pgn == PGN_F100) {
        g_vc_state = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FF21) {
        uint16_t rpm_raw  = le16(d[2], d[3]);
        int      rpm_mag  = (int)rpm_raw - RPM_BIAS;
        // Raw can jitter a bit below the zero-RPM bias at standstill; without
        // the clamp the uint16_t cast below would wrap a small negative to
        // ~65000 RPM (and a garbage speed).
        if (rpm_mag < 0) rpm_mag = 0;
        uint8_t  fnr      = d[7] & 0x0F;
        int8_t   dir      = (fnr == 0x4) ? 1 : (fnr == 0x8) ? -1 : 0;
        g_motor.rpm_magnitude      = (uint16_t)rpm_mag;
        g_motor.rpm_signed         = dir * rpm_mag;
        g_motor.direction          = dir;
        g_motor.range         = ((d[7] >> 4) & 0x0F) + 1;
        g_motor.current_a        = le16(d[0], d[1]);
        if (d[4]) g_motor.controller_temp_c = (int8_t)(d[4] - TEMP_OFFSET_C);
        if (d[5]) g_motor.motor_temp_c      = (int8_t)(d[5] - TEMP_OFFSET_C);
        g_motor.valid = true;
        g_motor.last_seen_ms = millis();

    } else if (src == SRC_DASH && pgn == PGN_FF21) {
        g_dash_alive = d[0];

    } else if (src == SRC_MOTOR && pgn == PGN_FECA) {
        uint32_t spn = d[2] | ((uint32_t)d[3] << 8)
                       | (((uint32_t)(d[4] >> 5) & 0x07) << 16);
        uint8_t fmi = d[4] & 0x1F;
        bool active = (spn || fmi);
        if (!d[0] && !d[1] && !active) {
            // Healthy idle — clear any previously latched DTC so the JSON
            // reports "presently inactive", not "last fault ever observed".
            g_dm1 = Dm1State();
            return;
        }
        g_dm1.lamp_byte0 = d[0];
        g_dm1.lamp_byte1 = d[1];
        g_dm1.dtc_spn    = spn;
        g_dm1.dtc_fmi    = fmi;
        g_dm1.dtc_cm     = (d[5] >> 7) & 0x01;
        g_dm1.dtc_oc     = d[5] & 0x7F;
        g_dm1.valid      = true;

    } else if (src == SRC_CHARGER && pgn == PGN_FF50) {
        if (allZero(d)) return;
        // Standard Elcon/TC charger status frame: BE-16 output voltage and
        // BE-16 output current (0.1/bit each), then a fault-flag byte
        // (CHGR_FLAG_*; 0x00 = actively delivering). Voltage reads the
        // charger's own output terminals — it equals pack V only while
        // delivering, so consumers gate any pack-V use on flags == 0.
        g_charger.v_raw     = be16(d[0], d[1]);
        g_charger.i_raw     = be16(d[2], d[3]);
        g_charger.flags     = d[4];
        g_charger.voltage_v = g_charger.v_raw * PACK_VOLTAGE_LSB_V;
        g_charger.current_a = g_charger.i_raw * CHARGER_I_LSB_A;
        g_charger.valid = true;

    } else if (src == SRC_BMS_CHGR_IF && pgn == PGN_PROP_0600) {
        uint16_t v_set = be16(d[0], d[1]);
        uint16_t i_set = be16(d[2], d[3]);
        g_chgr_cmd.enable = d[4];
        if (v_set || i_set) {
            g_chgr_cmd.voltage_v = v_set * 0.1f;
            g_chgr_cmd.current_a = i_set * 0.1f;
            g_chgr_cmd.v_raw     = v_set;
            g_chgr_cmd.i_raw     = i_set;
        } else {
            // Idle frame: V=0, I=0, enable=1 — clear the setpoint so the JSON
            // emits enable only, instead of freezing on the last active values.
            g_chgr_cmd.voltage_v = NAN;
            g_chgr_cmd.current_a = NAN;
            g_chgr_cmd.v_raw     = 0;
            g_chgr_cmd.i_raw     = 0;
        }
        g_chgr_cmd.valid = true;
    }
}

// ── Kelly e-hydraulic pump monitor (opt-in) ─────────────────────────────────────
#if defined(ENABLE_KELLY)
// Read-only serial monitor for the Kelly KLS pump controller on UART1. Ports the
// ETS protocol from kelly/solectrac-kelly-monitor.py: 8N1, three zero-data
// monitor queries 0x3A/0x3B/0x3C, each answered by [CMD,0x10,<16 data>,CHK]; the
// three 16-byte replies concatenate into a 48-byte block. Polling is a
// cooperative state machine so loop() never blocks. See kelly/README.md.

// UART1 is the Kelly port and nothing else, so name it for what is on the far
// end rather than for the peripheral index.
static HardwareSerial &kelly = Serial1;

// The Kelly transmits at its documented 19200 baud — fixed, no sweep; CONFIRMED
// by sustained ~99% frame success. An earlier ~19,900 figure (crystal-referenced
// edge timing) was measured through a doubly-corrupted receive path — an
// Arduino core 2.0.x firmware bug (fixed by the pioarduino/core-3.x platform,
// see platformio.ini) on top of the noisy RXD0 console pad (GPIO44, since
// moved to GPIO47/48) — and is void. The full story is in kelly/README.md
// §"Actual line rate".
static const uint32_t KELLY_BAUD = 19200;
static const uint8_t  KELLY_MON_CMDS[3]      = {0x3A, 0x3B, 0x3C};
static const uint32_t KELLY_POLL_INTERVAL_MS = 40;     // gap between individual queries
static const uint32_t KELLY_CMD_TIMEOUT_MS   = 600;    // per-command reply wait
                                                       // (matches the Python
                                                       // monitor's 0.6 s; the
                                                       // Kelly's turnaround plus
                                                       // loop latency exceeds a
                                                       // short window)
static const uint32_t KELLY_STALE_MS         = 5000;   // JSON freshness window (a
                                                       // little headroom over the
                                                       // observed worst-case gap)
static const uint32_t KELLY_FLASH_TIMEOUT_MS = 250;    // per flash-read exchange
                                                       // (a live link answers in
                                                       // ms; short so the whole
                                                       // burst is bounded)

// Display-only fault names by error_status bit (0..15). Kept in the renderer per
// project convention; the encoding (BE u16 @ block offset 16) is the protocol
// fact. Mirrors ERROR_NAMES in solectrac-kelly-monitor.py.
static const char* const KELLY_ERROR_NAMES[16] = {
    "Identify Err", "Over Volt", "Low Volt", "Reserved",
    "Locking", "V+ Err", "Overtemp", "High Pedel",
    "Reserved", "Reset Error", "Pedel Error", "Hall Sensor Error",
    "Reserved", "Emergency Rev Err", "Motor OverTemp Err", "Current Meter Err",
};

// Read-only by construction. Only two command sets ever reach the wire:
//   * kellySendQuery below — the three zero-data monitor queries (0x3A/3B/3C).
//   * kellyReadFlash below — a flash-session OPEN (0xF1) and block READs (0xF2),
//     for the on-demand /kelly/config dump.
// The write/burn/erase commands (0xF3/0xF4/0xB1..0xB4) are never emitted, so the
// firmware can read configuration but cannot alter it — mirroring the allowlists
// in the Python monitor and dump-config tools. Opening a flash session is benign:
// the official app does it on every connect to detect the model, and it clears
// when the controller powers off (no close is sent — 0xF4 doubles as the burn).
static bool kellyIsMonitorCmd(uint8_t cmd) {
    return cmd == 0x3A || cmd == 0x3B || cmd == 0x3C;
}
static void kellySendQuery(uint8_t cmd) {
    if (!kellyIsMonitorCmd(cmd)) return;          // refuse anything else
    const uint8_t frame[3] = {cmd, 0x00, cmd};    // [CMD, LEN=0, CHK=CMD]
    kelly.write(frame, sizeof(frame));
}

// Decode the 48-byte block into g_kelly. Offsets and raw (unscaled) semantics
// mirror Monitor.decode; only offsets 0..21 are defined by the protocol.
static void kellyDecodeBlock(const uint8_t* b) {
    g_kelly.tps_pedal         = b[0];
    g_kelly.brake_pedal       = b[1];
    g_kelly.brake_switch      = b[2];
    g_kelly.foot_switch       = b[3];
    g_kelly.forward_switch    = b[4];
    g_kelly.reverse_switch    = b[5];
    g_kelly.hall_a            = b[6];
    g_kelly.hall_b            = b[7];
    g_kelly.hall_c            = b[8];
    g_kelly.b_plus_v          = b[9];
    g_kelly.motor_temp_c      = b[10];   // raw byte, as the Python decode leaves it
    g_kelly.controller_temp_c = b[11];
    g_kelly.set_direction     = b[12];
    g_kelly.actual_direction  = b[13];
    g_kelly.brake_switch2     = b[14];
    g_kelly.low_speed         = b[15];
    g_kelly.error_status      = (uint16_t(b[16]) << 8) | b[17];   // big-endian
    g_kelly.motor_speed_rpm   = (uint16_t(b[18]) << 8) | b[19];
    g_kelly.phase_current_a   = (uint16_t(b[20]) << 8) | b[21];
    g_kelly.valid             = true;
    g_kelly.last_seen_ms      = millis();
}


void kellyInit() {
    // kelly.begin(baud, config, rxPin, txPin). The Kelly runs at a fixed 19200.
    kelly.begin(KELLY_BAUD, SERIAL_8N1, KELLY_RXD_PIN, KELLY_TXD_PIN);
}

// Fault-tolerant poller. Rotates through the monitor commands one at a time,
// caching each good reply in its own 16-byte slot with a timestamp. The decoded
// reading is rebuilt whenever every needed slot is recently fresh — so a single
// corrupted reply (EMI, a marginally-off baud) only delays that one slot instead
// of dropping the whole reading and flickering the card. Only 0x3A and 0x3B are
// polled: their 32 bytes carry every field kellyDecodeBlock reads (offsets
// 0..21); 0x3C's bytes are unused, so skipping it halves the frames per reading.
static const uint8_t KELLY_N_POLL = 2;   // poll KELLY_MON_CMDS[0..1] = 0x3A, 0x3B
void kellyPoll() {
    static enum { KIDLE, KWAIT } state = KIDLE;
    static uint8_t  block[KELLY_N_POLL * 16];
    static uint32_t slot_ms[KELLY_N_POLL] = {0};   // when each slot last refreshed
    static uint8_t  rxbuf[40];
    static uint8_t  rxlen  = 0;
    static uint8_t  cur    = 0;      // command index currently in flight
    static uint32_t next_ms = 0;     // earliest time to send the next query
    static uint32_t sent_ms = 0;     // when the current query went out
    static uint32_t sent_rx_total = 0;   // g_kelly_rx_total when the query went out

