schmmd/soleCAN/esp32-s3/src/main.cpp
    // Per-cell arrays (20 voltages, 7 temperatures; null if not yet received).
    // Emitted in the minimal/BLE payload too so the cell-detail view works over
    // Bluetooth as well as WiFi; costs ~200 B (a couple more BLE chunks).
    {
        auto cells = cells_obj["voltages"].to<JsonArray>();
        for (int i = 0; i < NUM_CELLS; i++) {
            if (!isnan(g_cell_v[i]))
                cells.add(roundf(g_cell_v[i] * 1000.0f) / 1000.0f);
            else
                cells.add(nullptr);
        }
        auto temps = cells_obj["temp_readings"].to<JsonArray>();
        for (int i = 0; i < NUM_TEMPS; i++) {
            if (!isnan(g_temp_c[i]))
                temps.add((int)g_temp_c[i]);
            else
                temps.add(nullptr);
        }
    }

    // BMS state
    if (g_bms_state.valid) {
        // Raw F106 bitmaps; the dashboard decodes the individual bits. Sent
        // in the minimal (BLE) payload too — the dashboard's BMS State panel
        // reads only these two bytes.
        auto st = doc["bms"]["state"].to<JsonObject>();
        st["byte0"] = g_bms_state.byte0;
        st["byte1"] = g_bms_state.byte1;
    }

    // BMS current limits
    if (g_bms_limit.valid) {
        auto lim = doc["bms"]["limit"].to<JsonObject>();
        addFloat(lim, "discharge_a", g_bms_limit.discharge_a, 2);
        addFloat(lim, "charge_a",    g_bms_limit.charge_a,    2);
        addFloat(lim, "charge_power_extra_w", g_bms_limit.charge_power_extra_w, 0);
        if (!minimal) {
            lim["mode"]  = g_bms_limit.mode;
            lim["byte5"] = g_bms_limit.byte5;
        }
    }

    // Combined fault codes (BMS + Motor Controller)
    auto faults = doc["faults"].to<JsonObject>();
    auto bms_codes = faults["bms"].to<JsonArray>();
    if (g_bms_faults.any_fault) {
        for (int code = 100; code <= 145; code++) {
            if (g_bms_faults.active_codes_mask & (1ULL << (code - 100)))
                bms_codes.add(code);
        }
    }
    auto mc_codes = faults["mc"].to<JsonArray>();
    if (g_dm1.valid && g_dm1.dtc_spn != 0)
        mc_codes.add(g_dm1.dtc_spn);

    // Motor — always emit so motor.alive is the canonical tractor-on signal.
    // FF21CA broadcasts at ~85 Hz; the MC stops within ~1s of key-off. The
    // 500 ms window catches brief key cycles without false-positiving on a
    // single dropped frame. last_seen_ms==0 means FF21CA has never been
    // heard in this boot — explicitly false rather than relying on a
    // millis()-rollover-from-zero accident.
    {
        auto mot = doc["motor"].to<JsonObject>();
        mot["alive"] = g_motor.last_seen_ms != 0
                       && (millis() - g_motor.last_seen_ms) < 500;
        if (g_motor.valid) {
            if (!minimal) mot["rpm_signed"] = g_motor.rpm_signed;
            mot["rpm_magnitude"] = g_motor.rpm_magnitude;
            mot["direction"]     = g_motor.direction;
            mot["range"]    = g_motor.range;
            mot["current_a"]  = g_motor.current_a;
            if (g_motor.controller_temp_c != INT8_MIN)
                mot["controller_temp_c"] = g_motor.controller_temp_c;
            if (g_motor.motor_temp_c != INT8_MIN)
                mot["motor_temp_c"] = g_motor.motor_temp_c;
        }
    }

    {
        uint32_t nowms = millis();
        bool mc_alive = g_motor.last_seen_ms != 0
                        && (nowms - g_motor.last_seen_ms) < 500;
        doc["tractor"] = mc_alive ? "on" : "off";
    }

#if defined(HAS_VIN_SENSE)
    if (!isnan(g_vin_v)) {
        doc["vin_v"] = roundf(g_vin_v * 10.0f) / 10.0f;
    }
#endif

#if defined(AUTOSHUTDOWN)
    switch (g_wake_cause) {
        case ESP_SLEEP_WAKEUP_EXT0:  doc["wake_cause"] = "can";      break;
        case ESP_SLEEP_WAKEUP_UNDEFINED: doc["wake_cause"] = "power_on"; break;
        default:                     doc["wake_cause"] = "other";    break;
    }
#endif

    // Charger
    if (g_charger.valid) {
        auto chg = doc["charger"].to<JsonObject>();
        chg["flags"] = g_charger.flags;
        if (!minimal) {
            chg["v_raw"]  = g_charger.v_raw;
            chg["i_raw"]  = g_charger.i_raw;
        }
        addFloat(chg, "voltage_v", g_charger.voltage_v, 2);
        addFloat(chg, "current_a", g_charger.current_a, 1);
    }

    // BMS→charger command
    if (g_chgr_cmd.valid) {
        auto cmd = doc["chgr_cmd"].to<JsonObject>();
        if (!minimal) cmd["enable"] = g_chgr_cmd.enable;
        addFloat(cmd, "voltage_v", g_chgr_cmd.voltage_v, 1);
        addFloat(cmd, "current_a", g_chgr_cmd.current_a, 1);
        if (!minimal && g_chgr_cmd.v_raw) cmd["v_raw"] = g_chgr_cmd.v_raw;
        if (!minimal && g_chgr_cmd.i_raw) cmd["i_raw"] = g_chgr_cmd.i_raw;
    }

#if defined(ENABLE_KELLY)
    // Kelly e-hydraulic pump controller. Emitted once we have ever decoded a
    // block this boot, so the card stays put (showing last-known values) when
    // the pump system is unpowered and the controller goes silent. The
    // dashboard dims on key-off, not on per-card freshness.
    // Key names match dashboard.html.
    if (g_kelly.valid) {
        auto k = doc["kelly"].to<JsonObject>();
        k["b_plus_v"]          = g_kelly.b_plus_v;
        k["motor_speed_rpm"]   = g_kelly.motor_speed_rpm;
        k["phase_current_a"]   = g_kelly.phase_current_a;
        k["motor_temp_c"]      = g_kelly.motor_temp_c;
        k["controller_temp_c"] = g_kelly.controller_temp_c;
        k["low_speed"]         = g_kelly.low_speed;
        k["error_status"]      = g_kelly.error_status;
        // The remaining monitor fields are decoded but stripped from the BLE
        // (minimal) payload to keep it small; the full WiFi /json carries all
        // 19, which the dashboard's Kelly detail view renders.
        if (!minimal) {
            k["tps_pedal"]        = g_kelly.tps_pedal;
            k["brake_pedal"]      = g_kelly.brake_pedal;
            k["brake_switch"]     = g_kelly.brake_switch;
            k["foot_switch"]      = g_kelly.foot_switch;
            k["forward_switch"]   = g_kelly.forward_switch;
            k["reverse_switch"]   = g_kelly.reverse_switch;
            k["hall_a"]           = g_kelly.hall_a;
            k["hall_b"]           = g_kelly.hall_b;
            k["hall_c"]           = g_kelly.hall_c;
            k["set_direction"]    = g_kelly.set_direction;
            k["actual_direction"] = g_kelly.actual_direction;
            k["brake_switch2"]    = g_kelly.brake_switch2;
        }
        auto errs = k["errors"].to<JsonArray>();
        for (int b = 0; b < 16; b++) {
            if (g_kelly.error_status & (1 << b)) errs.add(KELLY_ERROR_NAMES[b]);
        }
    }
    // Serial-path diagnostics. polls should climb
    // (board is querying); rx_total > 0 means the Kelly is answering; frames_ok
    // vs frames_bad is the per-attempt success rate on a live link; timeouts
    // counts attempts with zero bytes back (controller unpowered, e.g. key-off);
    // block_gap_max_ms is the worst flicker; last_rx shows raw bytes for
    // framing/baud checks.
    if (!minimal) {
        auto kd = doc["kelly_link"].to<JsonObject>();
        kd["polls"]       = g_kelly_polls;
        kd["rx_total"]    = g_kelly_rx_total;
        kd["baud"]        = KELLY_BAUD;
        kd["frames_ok"]   = g_kelly_frames_ok;
        kd["frames_bad"]  = g_kelly_frames_bad;
        kd["timeouts"]    = g_kelly_timeouts;
        kd["blocks_ok"]   = g_kelly_blocks_ok;
        kd["block_gap_max_ms"] = g_kelly_block_gap_max_ms;
        kd["block_gap_ms"]     = g_kelly_last_block_ms ? (millis() - g_kelly_last_block_ms) : 0;
        kd["last_rx_len"] = g_kelly_last_rx_len;
        char hex[65];
        uint8_t n = g_kelly_last_rx_len < 32 ? g_kelly_last_rx_len : 32;
        for (uint8_t i = 0; i < n; i++) sprintf(hex + i * 2, "%02X", g_kelly_last_rx[i]);
        hex[n * 2] = '\0';
        kd["last_rx"] = hex;
    }
#endif  // ENABLE_KELLY

    if (!minimal) {
        // Vehicle controller
        if (g_vc_state != 0xFF)
            doc["vc"]["state"] = g_vc_state;

        // Dashboard
        if (g_dash_alive != 0xFF)
            doc["dash"]["alive"] = g_dash_alive;

        // DM1 (raw FMI/OC/CM and lamp bytes — fault code is also in faults.mc)
        if (g_dm1.valid) {
            auto dm1 = doc["dm1"].to<JsonObject>();
            dm1["lamp_byte0"] = g_dm1.lamp_byte0;
            dm1["lamp_byte1"] = g_dm1.lamp_byte1;
            dm1["dtc_spn"]    = g_dm1.dtc_spn;
            dm1["dtc_fmi"]    = g_dm1.dtc_fmi;
            dm1["dtc_cm"]     = g_dm1.dtc_cm;
            dm1["dtc_oc"]     = g_dm1.dtc_oc;
        }
    }

#if defined(HAS_SD)
    // SD session-logging status the dashboard renders. Always emitted (small,
    // and the phone app mirrors the dashboard). Full diagnostics (parts,
    // recoveries, fail_op) live on /sd/status.
    {
        auto sd = doc["sd"].to<JsonObject>();
        sd["state"] = g_sd.state;
        if (g_sd_active) {
            sd["session"]    = g_sd.session;
            sd["kb_written"] = g_sd.kb_written;
            sd["free_mb"]    = g_sd.free_mb;
        }
        if (g_sd_raw.dropped)  sd["raw_dropped"]  = g_sd_raw.dropped;
        if (g_sd_json.dropped) sd["json_dropped"] = g_sd_json.dropped;
    }
#endif
#if defined(CANOPEN_POLL)
    if (!minimal) {
        auto co = doc["canopen"].to<JsonObject>();
        co["objects"]  = (uint32_t)(sizeof kCanopenObjects / sizeof kCanopenObjects[0]);
        co["sweeps"]   = g_canopen.sweeps;
        co["sent"]     = g_canopen.sent;
        co["replies"]  = g_canopen.replies;
        co["timeouts"] = g_canopen.timeouts;
        if (g_canopen.tx_fail) co["tx_fail"] = g_canopen.tx_fail;
    }
#endif

