schmmd/soleCAN/esp32-s3/src/main.cpp
    auto features = doc["features"].to<JsonObject>();
    features["can_tx"]    = (bool)CAN_TX_ENABLED;
#if defined(HAS_MCP2515)
    features["mcp2515"]   = true;
#else
    features["mcp2515"]   = false;
#endif
#if defined(HAS_VIN_SENSE)
    features["vin_sense"] = true;
#else
    features["vin_sense"] = false;
#endif

    auto wifi = doc["wifi"].to<JsonObject>();

    auto sta = wifi["sta"].to<JsonObject>();
    const bool join_sta = staConfigured();
    sta["ssid"]     = g_sta_ssid;                   // active STA SSID (NVS or default)
    sta["pass_set"] = (g_sta_pass[0] != '\0');      // presence only, never the password
    sta["enabled"]  = join_sta;
    const bool sta_connected = join_sta && WiFi.status() == WL_CONNECTED;
    sta["status"] = !join_sta ? "disabled"
                  : sta_connected ? "connected" : "connecting";
    if (sta_connected) {
        sta["ip"]   = WiFi.localIP().toString();
        sta["rssi"] = WiFi.RSSI();
    }
    sta["disconnects"] = (uint32_t)g_sta_disconnects;
    if (g_sta_disconnects > 0)
        sta["last_disconnect_reason"] =
            staDisconnectReasonName(g_sta_last_disconnect_reason);

    auto ap = wifi["ap"].to<JsonObject>();
    ap["ssid"]    = AP_SSID;
    ap["running"] = g_ap_running;
    if (g_ap_running) {
        ap["ip"]      = WiFi.softAPIP().toString();
        ap["clients"] = WiFi.softAPgetStationNum();
    }

    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

#if defined(ENABLE_KELLY)
// KBLS_0109 flash parameter map — a C++ mirror of PARAMS_KBLS_0109 in
// kelly/solectrac-kelly-dump-config.py, which stays the source of truth. It is
// duplicated here so /kelly/config decodes on-device (no companion script
// needed for a quick look); keep the two in sync. Encodings:
//   KP_BIT  → one bit at `pos` of the byte at `offset`      (value 0 or 1)
//   KP_BYTE → the single byte at `offset`
//   KP_WORD → `pos`+1 bytes at `offset`, big-endian
// fmt: KP_U unsigned number · KP_HEX lowercase hex string · KP_ASCII trimmed
// text. This is the version_word >= 265 map (this tractor reads 518); older
// firmware would need a different table — see the Python module.
enum : uint8_t { KP_BIT, KP_BYTE, KP_WORD };
enum : uint8_t { KP_U, KP_HEX, KP_ASCII };
struct KellyParam {
    const char* name;
    uint16_t    offset;
    uint8_t     size;
    uint8_t     pos;   // bit position (KP_BIT) or byte-count-1 (KP_WORD)
    uint8_t     fmt;
};
static const KellyParam KELLY_PARAMS[] = {
    {"Module Name",          0, KP_WORD, 7, KP_ASCII},
    {"User Name",            8, KP_WORD, 3, KP_ASCII},
    {"Serial Number",       12, KP_WORD, 3, KP_HEX},
    {"Software Version",     16, KP_WORD, 3, KP_HEX},
    {"Startup H-Pedel",     20, KP_BIT,  0, KP_U},
    {"Brake H-Pedel",       20, KP_BIT,  1, KP_U},
    {"NTL H-Pedel",         20, KP_BIT,  2, KP_U},
    {"Joystick",            20, KP_BIT,  4, KP_U},
    {"Three Gears Switch",  20, KP_BIT,  6, KP_U},
    {"Boost",               20, KP_BIT,  7, KP_U},
    {"Foot Switch",         21, KP_BIT,  0, KP_U},
    {"SW Level",            21, KP_BIT,  1, KP_U},
    {"0,HIM;1,KIM",         21, KP_BIT,  3, KP_U},
    {"Cruise",              21, KP_BIT,  4, KP_U},
    {"Anti-theft",          21, KP_BIT,  5, KP_U},
    {"Anti slip",           21, KP_BIT,  6, KP_U},
    {"Change Dir",          21, KP_BIT,  7, KP_U},
    {"Controller Volt",     23, KP_WORD, 1, KP_U},
    {"Low Volt",            25, KP_WORD, 1, KP_U},
    {"Over Volt",           27, KP_WORD, 1, KP_U},
    {"Hall Galvan Rate",    29, KP_WORD, 1, KP_U},
    {"PhaseCurr Max AD",    31, KP_WORD, 1, KP_U},
    {"Motor_Current%",      37, KP_BYTE, 0, KP_U},
    {"Batt_Current%",       38, KP_BYTE, 0, KP_U},
    {"Identify Angle",      56, KP_BYTE, 0, KP_U},
    {"Brake SW Level",      82, KP_BYTE, 0, KP_U},
    {"TPS Low",             92, KP_BYTE, 0, KP_U},
    {"TPS High",            93, KP_BYTE, 0, KP_U},
    {"TPS Type",            95, KP_BYTE, 0, KP_U},
    {"TPS Dead Low",        96, KP_BYTE, 0, KP_U},
    {"TPS Dead High",       97, KP_BYTE, 0, KP_U},
    {"TPS Forw MAP",        98, KP_BYTE, 0, KP_U},
    {"TPS Rev MAP",         99, KP_BYTE, 0, KP_U},
    {"Brake Type",         100, KP_BYTE, 0, KP_U},
    {"Brake Dead Low",     101, KP_BYTE, 0, KP_U},
    {"Brake Dead High",    102, KP_BYTE, 0, KP_U},
    {"Max Output Fre",     105, KP_WORD, 1, KP_U},
    {"Max Speed",          107, KP_WORD, 1, KP_U},
    {"Max Forw Speed%",    109, KP_BYTE, 0, KP_U},
    {"Max Rev Speed%",     110, KP_BYTE, 0, KP_U},
    {"MidSpeed Forw Speed",111, KP_BYTE, 0, KP_U},
    {"MidSpeed Rev Speed", 112, KP_BYTE, 0, KP_U},
    {"LowSpeed Forw Speed",113, KP_BYTE, 0, KP_U},
    {"LowSpeed Rev Speed", 114, KP_BYTE, 0, KP_U},
    {"Three Speed",        126, KP_BYTE, 0, KP_U},
    {"PWM frequency",      127, KP_BYTE, 0, KP_U},
    {"IQ Kp",              128, KP_WORD, 1, KP_U},
    {"IQ Ki",              130, KP_WORD, 1, KP_U},
    {"ID Kp",              134, KP_WORD, 1, KP_U},
    {"ID Ki",              136, KP_WORD, 1, KP_U},
    {"ID Err",             138, KP_WORD, 1, KP_U},
    {"HS_ACQR_Kp",         200, KP_WORD, 1, KP_U},
    {"HS_ACQR_Ki",         202, KP_WORD, 1, KP_U},
    {"HS_ACDR_Kp",         204, KP_WORD, 1, KP_U},
    {"HS_ACDR_Ki",         206, KP_WORD, 1, KP_U},
    {"BRK_AD Brk %#",      226, KP_BYTE, 0, KP_U},
    {"Anti-theft Curr#",   227, KP_BYTE, 0, KP_U},
    {"Brk_Speed Limit",    228, KP_WORD, 1, KP_U},
    {"RLS_TPS Brk Per%",   230, KP_BYTE, 0, KP_U},
    {"NTL Brk Per%",       231, KP_BYTE, 0, KP_U},
    {"Accel Time",         239, KP_BYTE, 0, KP_U},
    {"Accel Release Time", 240, KP_BYTE, 0, KP_U},
    {"Brake Time",         241, KP_BYTE, 0, KP_U},
    {"Brake Release Time", 242, KP_BYTE, 0, KP_U},
    {"BRK_SW Brk Per%",    243, KP_BYTE, 0, KP_U},
    {"Change Dir Brk%",    244, KP_BYTE, 0, KP_U},
    {"Compensation Per%",  245, KP_BYTE, 0, KP_U},
    {"IVT BRK Max",        246, KP_WORD, 1, KP_U},
    {"IVT BRK Min",        248, KP_WORD, 1, KP_U},
    {"Torque Speed Kp",    250, KP_WORD, 1, KP_U},
    {"Torque Speed Ki",    252, KP_WORD, 1, KP_U},
    {"Speed Err Limit",    254, KP_WORD, 1, KP_U},
    {"Motor Nominal Curr", 258, KP_WORD, 1, KP_U},
    {"Motor Poles",        268, KP_BYTE, 0, KP_U},
    {"Speed Sensor Type",  269, KP_BYTE, 0, KP_U},
    {"Resolver Poles",     272, KP_BYTE, 0, KP_U},
    {"Min Excitation Curr",310, KP_WORD, 1, KP_U},
    {"Motor Temp Sensor",  318, KP_BYTE, 0, KP_U},
    {"High Temp Cut C",    319, KP_BYTE, 0, KP_U},
    {"High Temp Resume",   320, KP_BYTE, 0, KP_U},
    {"High Temp Str C",    321, KP_BYTE, 0, KP_U},
    {"High Temp Week %",   322, KP_BYTE, 0, KP_U},
    {"Line Hall Zero",     332, KP_WORD, 1, KP_U},
    {"Line Hall amplitude",334, KP_WORD, 1, KP_U},
    {"Line Hall High Err", 336, KP_WORD, 1, KP_U},
    {"Line Hall Low Err",  338, KP_WORD, 1, KP_U},
    {"Swap Motor Phase",   340, KP_BYTE, 0, KP_U},
    {"Resolver init angle",341, KP_WORD, 1, KP_U},
    {"0 deg Hall",         343, KP_BYTE, 0, KP_U},
    {"60 deg Hall",        344, KP_BYTE, 0, KP_U},
    {"120 deg Hall",       345, KP_BYTE, 0, KP_U},
    {"180 deg Hall",       346, KP_BYTE, 0, KP_U},
    {"240 deg Hall",       347, KP_BYTE, 0, KP_U},
    {"300 deg Hall",       348, KP_BYTE, 0, KP_U},
    {"Forw A Rise Hall",   349, KP_BYTE, 0, KP_U},
    {"Forw A Fall Hall",   350, KP_BYTE, 0, KP_U},
    {"Rev A Rise Hall",    351, KP_BYTE, 0, KP_U},
    {"Rev A Fall Hall",    352, KP_BYTE, 0, KP_U},
};

// A whitespace/NUL byte that ASCII fields trim from both ends, matching the
// Python decoder's .strip("\x00").strip().
static bool kellyTrimByte(uint8_t c) {
    return c == 0x00 || c == ' ' || c == '\t' || c == '\n' ||
           c == '\r' || c == '\v' || c == '\f';
}

