schmmd/soleCAN/esp32-s3/src/main.cpp
static String hexString(const uint8_t* b, size_t n) {
    static const char hexd[] = "0123456789abcdef";   // not HEX: that's an Arduino macro
    String out; out.reserve(n * 2);
    for (size_t i = 0; i < n; i++) { out += hexd[b[i] >> 4]; out += hexd[b[i] & 0x0F]; }
    return out;
}

// Store `p`'s decoded value under its name: a bare number for KP_U and KP_BIT,
// a hex or trimmed-ASCII string otherwise. Mirrors read_param() in the Python
// dumper (non-ASCII bytes become U+FFFD, like decode("ascii", "replace")).
static void kellySetParam(JsonObject o, const uint8_t* f, const KellyParam& p) {
    if (p.size == KP_BIT) { o[p.name] = (f[p.offset] >> p.pos) & 1; return; }
    uint8_t n = (p.size == KP_BYTE) ? 1 : (uint8_t)(p.pos + 1);
    if (p.fmt == KP_HEX) {
        o[p.name] = hexString(f + p.offset, n);
    } else if (p.fmt == KP_ASCII) {
        int lo = p.offset, hi = p.offset + n;                 // half-open [lo, hi)
        while (lo < hi && kellyTrimByte(f[lo])) lo++;
        while (hi > lo && kellyTrimByte(f[hi - 1])) hi--;
        String v;
        for (int i = lo; i < hi; i++) {
            if (f[i] >= 0x80) v += "\xEF\xBF\xBD"; else v += (char)f[i];
        }
        o[p.name] = v;
    } else {                                                  // KP_U: big-endian unsigned
        uint32_t v = 0;
        for (uint8_t i = 0; i < n; i++) v = (v << 8) | f[p.offset + i];
        o[p.name] = v;
    }
}

// GET /kelly/config — one-shot, read-only dump of the Kelly pump's 512-byte
// flash configuration (the app's "AC Calibration" parameters). Static data, so
// it is fetched only on demand, never polled. The read blocks ~0.2 s (live
// link) up to ~3 s (flaky link), pausing CAN/monitor servicing for the burst —
// acceptable for a rare manual call.
//
// Returns the raw block as hex, the parsed version word, and the decoded
// KBLS_0109 parameters (KELLY_PARAMS above). blocks_read < 32 means the dump is
// partial: the missing 16-byte blocks read back as zeros, so their decoded
// fields are 0/empty.
void handleKellyConfig() {
    noteHttpActivity();
    static uint8_t flash[512];
    int ok = kellyReadFlash(flash);
    if (ok < 0) {
        server.send(503, "application/json",
                    "{\"error\":\"no flash session (Kelly unpowered or absent)\"}");
        return;
    }
    JsonDocument doc;
    doc["blocks_read"]  = ok;
    doc["blocks_total"] = 32;
    doc["version_word"] = (uint16_t(flash[16]) << 8) | flash[17];
    JsonObject params = doc["parameters"].to<JsonObject>();
    for (const KellyParam& p : KELLY_PARAMS) kellySetParam(params, flash, p);
    doc["raw"] = hexString(flash, sizeof(flash));
    String out;
    serializeJson(doc, out);
    server.send(200, "application/json", out);
}
#endif  // ENABLE_KELLY

// Human-facing STA WiFi form. Shows the current SSID and whether a password is
// set (never the password itself). Served on the always-up AP as well as STA,
// so it is reachable to fix a bad join.
void handleWifiForm() {
    noteHttpActivity();
    String body = F("<!doctype html><meta charset=utf-8><meta name=viewport "
                    "content='width=device-width,initial-scale=1'>"
                    "<title>WiFi setup</title><h2>SoleCAN WiFi</h2><p>Current SSID: <b>");
    body += staConfigured() ? htmlEscape(g_sta_ssid) : String("(none \xE2\x80\x94 AP only)");
    body += F("</b><br>Password set: ");
    body += g_sta_pass[0] ? F("yes") : F("no");
    body += F("</p><form method=post action=/wifi>"
              "<p>SSID (blank = AP only):<br><input name=ssid maxlength=32></p>"
              "<p>Password:<br><input name=pass type=password maxlength=63></p>"
              "<p>AP password (required):<br><input name=ap_pass type=password></p>"
              "<button type=submit>Save &amp; re-join</button></form>"
              "<p><a href=/>&lsaquo; Dashboard</a></p>");
    server.send(200, "text/html", body);
}

// Parse the desired USB mode from a `mode` query arg, a form-urlencoded field,
// or a `mode=…` plain body. Returns false if absent or not a valid mode.
static bool usbWantedMode(UsbMode& out) {
    String want = server.hasArg("mode") ? server.arg("mode") : String();
    if (want.length() == 0 && server.hasArg("plain")) {   // parse `mode=…` body
        String b = server.arg("plain");
        int i = b.indexOf("mode=");
        if (i >= 0) {
            want = b.substring(i + 5);
            int amp = want.indexOf('&');
            if (amp >= 0) want = want.substring(0, amp);
        }
    }
    return usbModeFromName(want, out);
}

// The selectable USB modes, in display order. kelly only when compiled in.
static const UsbMode kUsbModes[] = {
    USB_LOGGING, USB_SLCAN,
#if defined(ENABLE_KELLY)
    USB_KELLY,
#endif
};

// GET /usb — small self-contained, JS-free control page. Each mode is a POST
// form; submitting sets the mode and 303-redirects back here so the page
// re-renders with the active button marked (and a refresh doesn't re-submit).
void handleUsbPage() {
    noteHttpActivity();
    String body = F(
        "<!doctype html><meta charset=utf-8>"
        "<meta name=viewport content='width=device-width,initial-scale=1'>"
        "<title>USB mode</title><style>"
        "body{font-family:system-ui,sans-serif;max-width:420px;margin:0 auto;padding:16px;"
        "background:#f0f2f5;color:#212121}h2{font-size:1.1em}form{margin:0}"
        "button{display:block;width:100%;padding:14px;margin:8px 0;border:0;border-radius:10px;"
        "font-size:1em;background:#fff;box-shadow:0 1px 2px rgba(0,0,0,.1);cursor:pointer}"
        "button.on{background:#c8e6c9;color:#1b5e20;font-weight:600}"
        ".d{color:#757575;font-size:.85em}a{color:#1976d2}</style>"
        "<h2>USB port mode</h2>");
    for (UsbMode m : kUsbModes) {
        const char* name = usbModeName(m);
        bool on = (m == g_usb_mode);
        body += F("<form method=post action=/usb><button name=mode value=");
        body += name;
        if (on) body += F(" class=on");
        body += F(">");
        body += name;
        if (on) body += F(" \xE2\x9C\x93");   // ✓
        body += F("</button></form>");
    }
    body += F("<p class=d>logging = device debug logging messages<br>"
        "slcan = CAN adapter over USB"
#if defined(ENABLE_KELLY)
        "<br>kelly = hydraulic Kelly controller bridge over USB"
#endif
        "</p>");
    server.send(200, "text/html", body);
}

// POST /usb — the one mode-setting endpoint, for both the page's form buttons
// and scripting. Sets the mode from a submitted form field or query arg, then
// 303-redirects back to GET /usb so the page re-renders with the new state (and
// a refresh doesn't re-submit). Scripting: curl -L -X POST '.../usb?mode=slcan'.
// An unknown/unavailable mode is a 400; the buttons only ever submit valid ones.
void handleUsbPost() {
    noteHttpActivity();
    UsbMode m;
    if (!usbWantedMode(m)) {
        server.send(400, "text/plain", "unknown or unavailable mode\r\n");
        return;
    }
    g_usb_mode = m;
    server.sendHeader("Location", "/usb");
    server.send(303, "text/plain", "");
}

