schmmd/soleCAN/esp32-s3/src/main.cpp
static void handleSdList() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    JsonDocument doc;
    if (!sdListJson(doc)) { sdSendError(500, "open_root"); return; }
    String out;
    serializeJsonPretty(doc, out);
    server.send(200, "application/json", out);
}

// Minimal USTAR header for one regular file. `name` ("s00042/can_00.asc") is
// far below the 100-byte field. mtime is 0 — the ESP32 has no RTC, matching
// the nominal date in the .asc header.
static void tarFillHeader(uint8_t hdr[512], const char* name, uint32_t size) {
    memset(hdr, 0, 512);
    strncpy((char*)hdr, name, 99);                 // name
    memcpy(hdr + 100, "0000644", 8);               // mode
    memcpy(hdr + 108, "0000000", 8);               // uid
    memcpy(hdr + 116, "0000000", 8);               // gid
    char oct[13];
    snprintf(oct, sizeof oct, "%011lo", (unsigned long)size);
    memcpy(hdr + 124, oct, 12);                    // size
    memcpy(hdr + 136, "00000000000", 12);          // mtime
    hdr[156] = '0';                                // typeflag: regular file
    memcpy(hdr + 257, "ustar", 6);                 // magic (NUL-terminated)
    memcpy(hdr + 263, "00", 2);                    // version
    memset(hdr + 148, ' ', 8);                     // checksum: spaces while summing
    uint32_t sum = 0;
    for (int i = 0; i < 512; i++) sum += hdr[i];
    snprintf(oct, sizeof oct, "%06lo", (unsigned long)sum);
    memcpy(hdr + 148, oct, 6);
    hdr[154] = '\0';
    hdr[155] = ' ';
}

// Push `n` bytes to the client, tolerating partial writes. Bounded retries so
// a wedged socket can't hang the loop task forever.
static bool sdClientWrite(WiFiClient& client, const uint8_t* p, size_t n) {
    int stalls = 0;
    while (n) {
        if (!client.connected()) return false;
        size_t w = client.write(p, n);
        if (w == 0) {
            if (++stalls > 50) return false;
            delay(2);
            continue;
        }
        stalls = 0;
        p += w;
        n -= w;
    }
    return true;
}

// Parse the {id} path segment as a plain decimal session number.
// Returns false on empty/garbage (→ 404, matching a nonexistent session).
static bool sdParseIdArg(uint32_t& id) {
    String arg = server.pathArg(0);
    if (arg.isEmpty()) return false;
    char* end = nullptr;
    id = strtoul(arg.c_str(), &end, 10);
    return end && *end == '\0';
}

// Drain the CAN controllers and emit the periodic snapshot. Called from loop()
// and, per chunk, from the tar streamer so a multi-MB download never starves
// the sole CAN consumer.
static void canServiceTick();

// A session as one uncompressed USTAR stream, shared by GET /sd/sessions/{id}
// and the USB `sd get` command. Member sizes freeze at plan time, so the
// active session yields a consistent snapshot ≤~1 s stale. If a member reads
// short of its frozen size (read error / file gone), the stream is truncated,
// so the receiver detects a short read against the announced length rather
// than receiving a byte-perfect zero-filled file. The mutex is held per chunk,
// never across sink I/O. Callers hold an SdStreamGuard for the whole transfer
// so the reaper cannot delete the session mid-stream.
struct SdTarMember { String name; uint32_t size; };
typedef bool (*SdSink)(void* ctx, const uint8_t* p, size_t n);   // false = receiver gone

// Freeze the member list and compute the exact archive size. False = no such
// session. `dir` (≥ 24 bytes) receives the on-disk path resolved under the
// lock — it may carry a "-socSS" SOC suffix, so callers can't rebuild "/sNNNNN".
static bool sdTarPlan(uint32_t id, char* dir, size_t dir_cap,
                      std::vector<SdTarMember>& members, uint64_t& total) {
    {
        SdLock lock;
        if (!sdResolveDir(id, dir, dir_cap)) return false;
        File d = SD.open(dir);
        if (!d || !d.isDirectory()) {
            if (d) d.close();
            return false;
        }
        for (File f = d.openNextFile(); f; f = d.openNextFile()) {
            if (!f.isDirectory())
                members.push_back({ String(sdBasename(f.name())),
                                    (uint32_t)f.size() });
            f.close();
        }
        d.close();
    }
    total = 1024;   // end-of-archive: two zero blocks
    for (auto& m : members)
        total += 512 + (((uint64_t)m.size + 511) / 512) * 512;
    return true;
}

// Push the planned archive through `sink`. False = truncated (sink refused a
// write, or a member read short); the caller decides how to drop the connection.
static bool sdTarStream(const char* dir, const std::vector<SdTarMember>& members,
                        SdSink sink, void* ctx) {
    static uint8_t buf[4096];   // loop-task stack is tight; single-threaded caller
    for (auto& m : members) {
        char arcname[48], path[48];
        snprintf(arcname, sizeof arcname, "%s/%s", dir + 1, m.name.c_str());
        snprintf(path,    sizeof path,    "%s/%s", dir,     m.name.c_str());
        uint8_t hdr[512];
        tarFillHeader(hdr, arcname, m.size);
        if (!sink(ctx, hdr, 512)) return false;

        File f;
        { SdLock lock; f = SD.open(path, FILE_READ); }
        uint32_t sent = 0;
        bool ok = true;
        while (sent < m.size) {
            size_t want = m.size - sent;
            if (want > sizeof buf) want = sizeof buf;
            int n;
            { SdLock lock; n = f ? f.read(buf, want) : -1; }
            if (n <= 0 || !sink(ctx, buf, n)) { ok = false; break; }
            sent += n;
            canServiceTick();    // keep draining CAN between chunks; not under SdLock
            noteHttpActivity();  // a multi-minute download keeps deferring quiet sleep
        }
        { SdLock lock; if (f) f.close(); }
        if (!ok) return false;

        size_t pad = (512 - (m.size % 512)) % 512;
        if (pad) {
            memset(buf, 0, pad);
            if (!sink(ctx, buf, pad)) return false;
        }
    }
    memset(buf, 0, 1024);
    return sink(ctx, buf, 1024);   // end-of-archive trailer
}

static bool sdHttpSink(void* ctx, const uint8_t* p, size_t n) {
    return sdClientWrite(*static_cast<WiFiClient*>(ctx), p, n);
}

// GET /sd/sessions/{id} — see sdTarPlan/sdTarStream. Content-Length is exact,
// and a truncated stream closes the socket so the client sees the short read.
static void handleSdSessionGet() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    uint32_t id;
    if (!sdParseIdArg(id)) { sdSendError(404, "not_found"); return; }

    SdStreamGuard stream_guard(id);   // clears g_sd_http_stream_session on any return
    char dir[24];
    std::vector<SdTarMember> members;
    uint64_t total;
    if (!sdTarPlan(id, dir, sizeof dir, members, total)) { sdSendError(404, "not_found"); return; }
    if (total > UINT32_MAX) { sdSendError(507, "too_large"); return; }

    server.setContentLength((size_t)total);
    server.sendHeader("Content-Disposition",
                      String("attachment; filename=") + (dir + 1) + ".tar");   // sNNNNN[-socSS].tar
    server.send(200, "application/x-tar", "");
    WiFiClient client = server.client();
    if (!sdTarStream(dir, members, sdHttpSink, &client)) client.stop();
}

// DELETE /sd/sessions/{id} — recursively remove a session directory via the
// reaper's helper. The active session is never deletable. free_mb is
// recomputed here (usedBytes() is slow, but deletes are rare) so the response
// reflects the space just reclaimed.
static const char* sdDeleteSession(uint32_t id, uint32_t& free_mb) {
    if (id == g_sd.session) return "active_session";
    // Cannot race on the single-threaded WebServer, but refuse deleting a
    // session an HTTP client is streaming — one line, future-proof.
    if (id == g_sd_http_stream_session) return "streaming";

    char dir[24];   // resolved under the lock — may carry a "-socSS" SOC suffix

    enum Result { OK, NOT_FOUND, REMOVE_FAILED } result = OK;
    free_mb = 0;
    {
        SdLock lock;
        if (!sdResolveDir(id, dir, sizeof dir)) {
            result = NOT_FOUND;
        } else {
            if (!sdRemoveSessionDir(dir)) {
                result = REMOVE_FAILED;
            } else {
                uint64_t total = SD.totalBytes();
                uint64_t used  = SD.usedBytes();
                g_sd.free_mb = (uint32_t)((total > used ? total - used : 0) >> 20);
                free_mb = g_sd.free_mb;
            }
        }
    }
    if (result == NOT_FOUND)     return "not_found";
    if (result == REMOVE_FAILED) return "remove_failed";
    return nullptr;
}

static void handleSdSessionDelete() {
    noteHttpActivity();
    if (!g_sd_active) { sdSendError(503, "sd_unavailable"); return; }
    uint32_t id;
    if (!sdParseIdArg(id)) { sdSendError(404, "not_found"); return; }
    uint32_t free_mb;
    const char* err = sdDeleteSession(id, free_mb);
    if (err) {
        int code = !strcmp(err, "not_found") ? 404
                 : !strcmp(err, "remove_failed") ? 500 : 409;
        sdSendError(code, err);
        return;
    }
    server.send(200, "application/json",
                String("{\"free_mb\":") + free_mb + "}");
}
#endif  // HAS_SD

