schmmd/soleCAN/esp32-s3/src/main.cpp
void handleNotFound() {
    // The soft-AP's wildcard DNS lands every hostname here, including phone
    // connectivity probes (generate_204 / hotspot-detect.html). Answering
    // those with a redirect — not a 404 — makes the OS classify the AP as a
    // captive portal and auto-open the dashboard when someone joins.
    // localIP() is the board's address on whichever interface the request
    // arrived on, so it also tells AP requests apart from station ones: on the
    // bench network there's no wildcard DNS and no portal to satisfy, so a
    // mistyped path should say 404 rather than silently bounce to the root.
    IPAddress local = server.client().localIP();
    if (local != WiFi.softAPIP()) {
        server.send(404, "text/plain", "Not found: " + server.uri() + "\n");
        return;
    }
    server.sendHeader("Location", "http://" + local.toString() + "/");
    server.send(302, "text/plain", "");
}

// ── USB mode: console `mode` command + logging-mode input/heartbeat ───────────
// Recognizes a `mode` line typed over the USB console. `mode` alone reports the
// current + available modes; `mode <name>` switches. Returns true if the line was
// a mode command, so the SLCAN handler can consume it before its own parsing.
static bool tryModeCommand(const char* line) {
    if (strncmp(line, "mode", 4) != 0) return false;
    const char* p = line + 4;
    while (*p == ' ' || *p == '\t') p++;
    if (*p == '\0') {                       // bare `mode` -> report
        Serial.printf("usb mode: %s (available: logging slcan"
#if defined(ENABLE_KELLY)
                      " kelly"
#endif
                      ")\r\n", usbModeName(g_usb_mode));
        return true;
    }
    char name[16]; size_t n = 0;            // first whitespace-delimited token
    while (p[n] && p[n] != ' ' && p[n] != '\t' && n < sizeof(name) - 1) {
        name[n] = p[n]; n++;
    }
    name[n] = '\0';
    UsbMode m;
    if (usbModeFromName(String(name), m)) {
        g_usb_mode = m;
        Serial.printf("usb mode -> %s\r\n", usbModeName(m));
    } else {
        Serial.printf("usb mode: unknown '%s'\r\n", name);
    }
    return true;
}

// Recognizes a `wifi` line over the USB console. Wired into both the logging poll
// and the SLCAN dispatch, so it works in any USB role. `wifi` alone reports the
// station SSID and link state; `wifi clear` erases the stored STA credentials and
// drops to a solid AP-only radio — the field reset when a stale/out-of-range STA
// network keeps dragging the soft-AP beacon off-channel. Returns true if the line
// was a wifi command, so the SLCAN handler consumes it before its own parsing.
static bool tryWifiCommand(const char* line) {
    if (strncmp(line, "wifi", 4) != 0) return false;
#if defined(NO_WIFI)
    Serial.printf("wifi: disabled in this build (-DNO_WIFI)\r\n");
    return true;                            // never touch the radio in a silent build
#else
    const char* p = line + 4;
    while (*p == ' ' || *p == '\t') p++;
    if (strcmp(p, "clear") == 0) {
        g_sta_ssid[0] = g_sta_pass[0] = '\0';
        saveStaCreds(g_sta_ssid, g_sta_pass);   // persist blank -> AP-only after reboot too
        // Tear down the live STA link *before* dropping to AP-only. Order matters:
        // WiFi.mode(WIFI_AP) removes the STA interface, so a disconnect issued
        // after it never deauths — the radio stays associated (sta=connected) until
        // reboot. eraseap=true also wipes the driver's remembered AP so it can't
        // silently reassociate.
        WiFi.disconnect(/*wifioff=*/true, /*eraseap=*/true);
        WiFi.mode(WIFI_AP);
        Serial.printf("wifi: STA cleared -> AP-only\r\n");
    } else if (*p == '\0') {
        Serial.printf("wifi: ssid=\"%s\" sta=%s\r\n", g_sta_ssid,
                      WiFi.status() == WL_CONNECTED ? "connected" : "down");
    } else {
        Serial.printf("wifi: unknown '%s' (try: wifi | wifi clear)\r\n", p);
    }
    return true;
#endif
}

#if defined(HAS_SD)
// Never hand HWCDC more than its free ring space. Its SOF-watchdog "plugged"
// state flaps for a few ms even on a healthy link, and a write that arrives
// during a flap takes the not-connected path: if the write is larger than the
// ring it keeps only the ring's worth of it, drops the rest, and still reports
// the full size — observed on the bench as a 19 MB pull landing ~3.8 KB short
// with a splice mid-file. A write that fits the free space is simply queued on
// that path, so sizing each write to availableForWrite() makes a flap harmless.
static bool sdUsbSink(void*, const uint8_t* p, size_t n) {
    uint32_t stall_ms = 0;
    while (n) {
        size_t room = Serial.availableForWrite();
        size_t w = room ? Serial.write(p, room < n ? room : n) : 0;
        if (w == 0) {                       // ring full: host is behind (or gone)
            if (++stall_ms > 2000) return false;
            delay(1);
            continue;
        }
        stall_ms = 0;
        p += w;
        n -= w;
    }
    return true;
}
#endif

// Recognizes an `sd` line over the USB console: the /sd/* HTTP API without WiFi,
// for pulling sessions over the (much faster) USB cable. Wired into both the
// logging poll and the SLCAN dispatch like `wifi`. Every reply starts with
// "sd: " so a host can skip interleaved log lines. See esp32-s3/sd-pull.py.
//   sd           -> sd: {status json}        (GET /sd/status)
//   sd list      -> sd: {sessions json}      (GET /sd/sessions)
//   sd get N     -> sd: tar N <bytes>\r\n then exactly <bytes> of USTAR
//                   (GET /sd/sessions/N; a short stream = the same truncation)
//   sd delete N  -> sd: deleted N free_mb=M  (DELETE /sd/sessions/N)
//   errors       -> sd: error <tag>          (the HTTP API's tags)
static bool trySdCommand(const char* line) {
    if (strncmp(line, "sd", 2) != 0) return false;
    if (line[2] != '\0' && line[2] != ' ' && line[2] != '\t') return false;
#if !defined(HAS_SD)
    Serial.printf("sd: error no_sd_reader\r\n");   // board has no card slot
    return true;
#else
    const char* p = line + 2;
    while (*p == ' ' || *p == '\t') p++;
    JsonDocument doc;
    String out;
    if (*p == '\0') {
        sdStatusJson(doc);
        serializeJson(doc, out);
        Serial.printf("sd: %s\r\n", out.c_str());   // one write: no log line can split it
        return true;
    }
    if (!g_sd_active) { Serial.printf("sd: error sd_unavailable\r\n"); return true; }
    if (strcmp(p, "list") == 0) {
        if (!sdListJson(doc)) { Serial.printf("sd: error open_root\r\n"); return true; }
        serializeJson(doc, out);
        Serial.printf("sd: %s\r\n", out.c_str());
        return true;
    }
    bool get = strncmp(p, "get ", 4) == 0, del = strncmp(p, "delete ", 7) == 0;
    const char* num = p + (get ? 4 : 7);
    char* end = nullptr;
    uint32_t id = (get || del) ? strtoul(num, &end, 10) : 0;
    if (!(get || del) || !end || *end != '\0' || end == num) {
        Serial.printf("sd: error bad_command (try: sd | sd list | sd get N | sd delete N)\r\n");
        return true;
    }
    if (del) {
        uint32_t free_mb;
        const char* err = sdDeleteSession(id, free_mb);
        if (err) Serial.printf("sd: error %s\r\n", err);
        else     Serial.printf("sd: deleted %lu free_mb=%lu\r\n",
                               (unsigned long)id, (unsigned long)free_mb);
        return true;
    }
    SdStreamGuard stream_guard(id);   // reaper must not delete it mid-stream
    char dir[24];
    std::vector<SdTarMember> members;
    uint64_t total;
    if (!sdTarPlan(id, dir, sizeof dir, members, total)) { Serial.printf("sd: error not_found\r\n"); return true; }
    if (total > UINT32_MAX)             { Serial.printf("sd: error too_large\r\n"); return true; }
    g_usb_sd_stream = true;            // mute log echo + SLCAN frames until done
    Serial.printf("sd: tar %lu %lu\r\n", (unsigned long)id, (unsigned long)total);
    sdTarStream(dir, members, sdUsbSink, nullptr);  // short stream = truncation, as HTTP
    Serial.flush();
    g_usb_sd_stream = false;
    return true;
#endif
}

