schmmd/soleCAN/esp32-s3/src/main.cpp
// Runs each loop iteration while in LOGGING mode: accepts a `mode` command typed
// over USB (other input discarded) and emits a ~10 s device-status heartbeat.
void usbLoggingPoll() {
    static char    buf[24];
    static uint8_t len = 0;
    while (Serial.available()) {            // (a) line-buffered `mode` command
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (len > 0) {
                buf[len] = '\0';
                if (!tryModeCommand(buf) && !tryWifiCommand(buf)) trySdCommand(buf);
                len = 0;
            }
        } else if (len < sizeof(buf) - 1) {
            buf[len++] = c;
        } else {
            len = 0;                        // overlong line: reset (commands are short)
        }
    }

    static uint32_t next = 0;               // (b) periodic heartbeat
    uint32_t now = millis();
    if (now < next) return;
    next = now + 10000;
    uint32_t age = g_frames_rx ? (now - g_last_frame_ms) : 0;
    char msg[160];
    int w = snprintf(msg, sizeof(msg),
        "[%lus] usb=logging  can:%lu rx last %lus  wifi=%s  heap=%u",
        (unsigned long)(now / 1000), (unsigned long)g_frames_rx,
        (unsigned long)(age / 1000),
        WiFi.status() == WL_CONNECTED ? "sta" : (g_ap_running ? "ap" : "down"),
        (unsigned)ESP.getFreeHeap());
#if defined(ENABLE_KELLY)
    if (g_kelly.valid && w > 0 && w < (int)sizeof(msg))
        snprintf(msg + w, sizeof(msg) - w, "  kelly:%lu rx last %lus",
                 (unsigned long)g_kelly_blocks_ok,
                 (unsigned long)((now - g_kelly.last_seen_ms) / 1000));
#endif
    logLine("%s", msg);
}

// ── SLCAN ─────────────────────────────────────────────────────────────────────
// Presents the CAN bus as an SLCAN device over USB CDC serial.
// python-can: interface='slcan', channel='/dev/cu.usbmodem...'
// Receive always works; transmit (t/T commands) is gated on -DCAN_ALLOW_TX and
// routes to can0 (the native TWAI controller) only — SLCAN has no channel
// concept, so it never reaches the MCP2515 (can1). A listen-only build answers
// every t/T with BELL.

// slcan_buf/slcan_len/slcan_open are declared near the top of the
// "── HTTP handlers ──" section (main.cpp:1902-1904, ahead of this section)
// so handleWifiSave's boot-log line can reference slcan_open before this
// section runs at file scope.

void slcanSendFrame(const twai_message_t& msg) {
    if (!slcan_open || g_usb_sd_stream) return;
    char line[32];
    // 'T' + 8 hex ID digits for 29-bit frames, 't' + 3 for 11-bit.
    int n = msg.extd
        ? snprintf(line, sizeof(line), "T%08" PRIX32 "%u",
                   msg.identifier, msg.data_length_code)
        : snprintf(line, sizeof(line), "t%03" PRIX32 "%u",
                   msg.identifier, msg.data_length_code);
    // Bound n so the two hex digits and the trailing '\r' always fit: if n
    // ever passed sizeof(line), the sizeof(line) - n below would underflow
    // and line[n++] would land out of bounds. Unreachable while loop()
    // clamps DLC to 8, but the formatter shouldn't lean on that.
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 3; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    line[n++] = '\r';
    // Never block the CAN drain on a stalled USB host: if the CDC TX buffer
    // can't take the whole line, drop it (like the SD ring and the socketcand
    // tap) rather than stall loop() per frame. A reader that opened the SLCAN
    // tap but stopped draining — e.g. the bench soak, which holds the port open
    // while flooding the bus — would otherwise make every Serial.write() block,
    // starving HTTP/BLE and overflowing the RX queue under load.
    if (Serial.availableForWrite() >= n)
        Serial.write((uint8_t*)line, n);
    else
        g_slcan_tx_dropped++;
}

// Single hex digit -> 0..15, or -1 if not a hex character.
static int hexNibble(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return c - 'a' + 10;
    if (c >= 'A' && c <= 'F') return c - 'A' + 10;
    return -1;
}

#if CAN_TX_ENABLED
// Inject a frame onto can0 (native TWAI). Shared by the SLCAN t/T handler and
// the socketcand channel-0 `< send >` so the two TX paths can't drift. Returns
// true if the driver queued the frame. Only compiled when TX is enabled — in a
// listen-only build there is no code that can reach the bus.
static bool canTransmit0(uint32_t id, bool extd, uint8_t dlc, const uint8_t* data) {
    twai_message_t tx = {};
    tx.identifier       = id;
    tx.extd             = extd ? 1 : 0;
    tx.data_length_code = dlc;
    memcpy(tx.data, data, dlc);
    return twai_transmit(&tx, pdMS_TO_TICKS(10)) == ESP_OK;
}
#endif

#if defined(CANOPEN_POLL)
static inline void canopenOnFrame(const twai_message_t& msg) {
    if (!msg.extd && msg.identifier == CANOPEN_SDO_RESP_ID && g_canopen.pending) {
        g_canopen.pending = false;
        g_canopen.replies++;
    }
}

static void canopenPollTick() {
    uint32_t now = millis();
    if (g_canopen.pending) {
        if (now - g_canopen.sent_ms < CANOPEN_POLL_TIMEOUT_MS) return;
        g_canopen.pending = false;
        g_canopen.timeouts++;
    }
    if (now - g_canopen.sent_ms < CANOPEN_POLL_GAP_MS) return;
    if (!g_motor.last_seen_ms || now - g_motor.last_seen_ms > CANOPEN_ALIVE_MS) return;
    uint16_t index = kCanopenObjects[g_canopen.idx];
    uint8_t req[8] = { 0x40, (uint8_t)(index & 0xFF), (uint8_t)(index >> 8), 0x00, 0, 0, 0, 0 };
    g_canopen.sent_ms = now;
    if (!canTransmit0(CANOPEN_SDO_REQ_ID, false, 8, req)) { g_canopen.tx_fail++; return; }
    g_canopen.sent++;
    g_canopen.pending = true;
    if (++g_canopen.idx >= sizeof kCanopenObjects / sizeof kCanopenObjects[0]) {
        g_canopen.idx = 0;
        g_canopen.sweeps++;
    }
}
#endif  // CANOPEN_POLL

void slcanHandleCommand(const char* cmd) {
    // A `mode …`, `wifi …` or `sd …` line is consumed here first; none collides
    // with SLCAN's single-letter commands (SLCAN's `s` takes hex, never `sd`),
    // so python-can is unaffected.
    if (tryModeCommand(cmd)) return;
    if (tryWifiCommand(cmd)) return;
    if (trySdCommand(cmd)) return;
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        // Transmit: t<iii><l><dd..> (11-bit) / T<iiiiiiii><l><dd..> (29-bit).
        // Reply CR on success, BELL (\a) on any parse/TX error — the Lawicel
        // convention python-can tolerates. Only functional when built with
        // -DCAN_ALLOW_TX; a listen-only build rejects every frame with BELL.
        case 't':
        case 'T': {
#if !CAN_TX_ENABLED
            Serial.write('\a');   // listen-only build: injection disabled
#else
            if (!slcan_open) { Serial.write('\a'); break; }
            bool extd = (cmd[0] == 'T');
            int idlen = extd ? 8 : 3;
            size_t len = strlen(cmd);
            if (len < (size_t)(1 + idlen + 1)) { Serial.write('\a'); break; }
            bool bad = false;
            uint32_t id = 0;
            for (int i = 0; i < idlen && !bad; i++) {
                int nib = hexNibble(cmd[1 + i]);
                if (nib < 0) bad = true; else id = (id << 4) | (uint32_t)nib;
            }
            int dlc = hexNibble(cmd[1 + idlen]);
            if (bad || dlc < 0 || dlc > 8) { Serial.write('\a'); break; }
            if (len < (size_t)(1 + idlen + 1 + dlc * 2)) { Serial.write('\a'); break; }
            id &= extd ? 0x1FFFFFFFUL : 0x7FFUL;
            uint8_t data[8] = {0};
            const char* dp = cmd + 1 + idlen + 1;
            for (int i = 0; i < dlc && !bad; i++) {
                int hi = hexNibble(dp[i * 2]), lo = hexNibble(dp[i * 2 + 1]);
                if (hi < 0 || lo < 0) bad = true; else data[i] = (uint8_t)((hi << 4) | lo);
            }
            if (bad) { Serial.write('\a'); break; }
            Serial.write(canTransmit0(id, extd, (uint8_t)dlc, data) ? '\r' : '\a');
#endif
            break;
        }
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='tractor.local', port=28600,
//             channel='can0'
//
// One slot per channel — a client picks its bus with `< open canN >`. On the
// T-2CAN both buses are streamed (can0 = TWAI, can1 = MCP2515); on the
// Feather only can0 is available. Two clients can be connected at once on the
// T-2CAN, one per channel. A new connection that arrives while every slot is
// taken is rejected (the existing clients are kept).

#define SOCKETCAND_PORT 28600
// A client that connects but never completes the open/rawmode handshake would
// pin its slot forever; reclaim the slot after this long.
#define SOCKETCAND_HANDSHAKE_MS 10000

