schmmd/soleCAN/esp32-s3/src/main.cpp
void bleInit() {
    BLEDevice::init(MDNS_NAME);
    BLEDevice::setMTU(517);

    g_ble_server = BLEDevice::createServer();
    g_ble_server->setCallbacks(new BleServerCb());

    BLEService* svc = g_ble_server->createService(NUS_SVC_UUID);
    // NimBLE adds the 0x2902 CCC descriptor automatically for NOTIFY
    // characteristics; adding one manually is deprecated.
    g_ble_tx = svc->createCharacteristic(NUS_TX_UUID, BLECharacteristic::PROPERTY_NOTIFY);
    svc->createCharacteristic(NUS_RX_UUID,
        BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
    svc->start();

    BLEAdvertising* adv = BLEDevice::getAdvertising();
    adv->addServiceUUID(NUS_SVC_UUID);
    adv->setScanResponse(true);
    BLEDevice::startAdvertising();
}

// In-flight framed payload, drained one chunk per bleTick() call so the loop
// never sleeps on BLE (the previous blocking send cost ~25 ms per push).
// 8 KB scratch is plenty: minimal JSON for this dashboard runs ~800 B
// (incl. the per-cell voltage/temperature arrays).
static uint8_t  g_ble_tx_buf[2 + 8192];
static size_t   g_ble_tx_len = 0;   // framed bytes queued; == off when idle
static size_t   g_ble_tx_off = 0;   // next byte to notify
static uint32_t g_ble_chunk_ms = 0; // millis() of the last chunk sent

static void bleQueueFramed(const String& payload) {
    size_t total = payload.length();
    if (total > 65535 || total + 2 > sizeof(g_ble_tx_buf)) return;
    g_ble_tx_buf[0] = (uint8_t)((total >> 8) & 0xFF);
    g_ble_tx_buf[1] = (uint8_t)(total & 0xFF);
    memcpy(g_ble_tx_buf + 2, payload.c_str(), total);
    g_ble_tx_len = 2 + total;
    g_ble_tx_off = 0;
}

void bleTick() {
    // Log connect/disconnect edges here rather than in the callbacks: those run
    // on the Bluedroid task and logLine() may echo to Serial.
    static bool was_connected = false;
    if (g_ble_connected != was_connected) {
        was_connected = g_ble_connected;
        logLine("BLE: client %s", was_connected ? "connected" : "disconnected");
    }
    if (!g_ble_connected || !g_ble_tx) {
        g_ble_tx_len = g_ble_tx_off = 0;   // abort any in-flight frame
        return;
    }
    uint32_t now = millis();

    // Drain the in-flight frame first — one chunk per tick, keeping the
    // 5 ms inter-chunk spacing on the wire. No new payload is built until
    // the frame completes, so frames are never interleaved.
    if (g_ble_tx_off < g_ble_tx_len) {
        if (now - g_ble_chunk_ms < BLE_INTER_CHUNK_DELAY) return;
        size_t n = g_ble_tx_len - g_ble_tx_off;
        if (n > BLE_CHUNK_BYTES) n = BLE_CHUNK_BYTES;
        g_ble_tx->setValue(g_ble_tx_buf + g_ble_tx_off, n);
        g_ble_tx->notify();
        g_ble_tx_off += n;
        g_ble_chunk_ms = now;
        return;
    }

    // Adaptive cadence, keyed on frame arrival rather than a payload diff —
    // frames_rx is in the payload, so any received frame changes the JSON
    // and a diff could never suppress a push on an active bus anyway.
    bool bus_active = g_frames_rx != g_ble_frames_at_push;
    uint32_t interval = bus_active ? BLE_PUSH_INTERVAL_MS : BLE_HEARTBEAT_MS;
    if (!g_ble_force_push && now - g_ble_last_push_ms < interval) return;
    g_ble_force_push     = false;
    g_ble_last_push_ms   = now;
    g_ble_frames_at_push = g_frames_rx;
    bleQueueFramed(buildJson(false /*pretty*/, true /*minimal*/));
}

// ── Setup & loop ──────────────────────────────────────────────────────────────

void setup() {
    Serial.begin(115200);
    Serial.setTxBufferSize(8192);   // USB CDC TX ring (default 256 B): `sd get` writes ring-sized pieces

    ledInit();
    ledWrite(4, 4, 4);   // dim white the moment firmware starts running

#if defined(AUTOSHUTDOWN)
    // A wake from deep sleep is a full reboot, so this runs on every wake too.
    // Capture the cause for /json before anything else touches the RTC state.
    g_wake_cause = esp_sleep_get_wakeup_cause();

#if defined(BOARD_REJSACAN)
    // Release the pins checkCanQuietSleep() held through the previous sleep
    // (no-op on a cold boot / power-on reset) before reconfiguring them below.
    gpio_hold_dis(CAN_RS_PIN);
    gpio_hold_dis(FORCE_ON_PIN);
    gpio_hold_dis(YELLOW_LED_PIN);
    gpio_hold_dis(BLUE_LED_PIN);
    gpio_deep_sleep_hold_dis();
#endif
#endif

#if defined(BOARD_REJSACAN)
    // Drive the transceiver into high-speed normal mode (RS=LOW) and assert
    // the auto-shutdown override so the board stays on across vehicle/key
    // cycles. Both must happen before the TWAI driver starts — otherwise the
    // bus floats and the first frames after boot are lost.
    pinMode(CAN_RS_PIN, OUTPUT);
    digitalWrite(CAN_RS_PIN, LOW);
    pinMode(FORCE_ON_PIN, OUTPUT);
    digitalWrite(FORCE_ON_PIN, HIGH);
#endif

#if defined(ENABLE_KELLY)
    kellyInit();   // Kelly pump monitor on UART1 (GPIO47/48)
#endif

    for (int i = 0; i < NUM_CELLS; i++) g_cell_v[i] = NAN;
    for (int i = 0; i < NUM_TEMPS; i++) g_temp_c[i] = NAN;

    // CAN at 250 kbit/s (J1939 standard). Default rx_queue_len is 5, which
    // overflows whenever the loop stalls — serving the ~26 KB dashboard over
    // HTTP is the longest single handler. A saturated 250 kbit/s bus is
    // ~1800 frames/s, so 512 frames buffer ~280 ms of worst-case traffic
    // (longer at realistic bus load) for ~10 KB of DRAM.
    //
    // Bus mode is set by CAN_TX_ENABLED (see -DCAN_ALLOW_TX up top). Default is
    // LISTEN_ONLY: the controller never transmits — no ACKs, no error frames —
    // so it is electrically incapable of perturbing other nodes, and every TX
    // path (SLCAN injection, socketcand client->bus send) is dead at the
    // silicon level. -DCAN_ALLOW_TX selects NORMAL, which ACKs frames and arms
    // those TX paths.
#if CAN_TX_ENABLED
    const twai_mode_t kCanMode = TWAI_MODE_NORMAL;
#else
    const twai_mode_t kCanMode = TWAI_MODE_LISTEN_ONLY;
#endif
    twai_general_config_t can_cfg = TWAI_GENERAL_CONFIG_DEFAULT(
        CAN_TX_PIN, CAN_RX_PIN, kCanMode);
    can_cfg.rx_queue_len = 512;
    can_cfg.tx_queue_len = 32;
    twai_timing_config_t  tim_cfg = TWAI_TIMING_CONFIG_250KBITS();
    twai_filter_config_t  flt_cfg = TWAI_FILTER_CONFIG_ACCEPT_ALL();
    esp_err_t err = twai_driver_install(&can_cfg, &tim_cfg, &flt_cfg);
    if (err == ESP_OK) {
        err = twai_start();
        if (err == ESP_OK) g_can_initialized = true;
    }

